/*
KANJI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");

YOMI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");
*/

const CLASS = 5;
const KENTEI_NAME = "五級";
const FILE_NAME = "5class"; // 「○○.html」などで使用
const GENRE = ["植物", "魚介類", "虫", "動物", "物・現象"];
const Q_NUM = [10, 10, 10, 5]; // 大問ごとの問題数
const UNIT_SCORE = [3, 3, 3, 2]; // 大問ごとにおける一問正解の配点
const MAX_SCORE = 100; // 満点
const GOKAKU_SCORE = 80; // 合格点

let QUESTION_STR = new Array(); // 問題文＋配点
let KANJI = new Array(); // 出題漢字
let YOMI = new Array(); // 正解

// 多次元配列の生成
for (let i=0; i<10; i++) {
	QUESTION_STR[i] = new Array();
	KANJI[i] = new Array();
	YOMI[i] = new Array();
}

// Q1

QUESTION_STR[0][0] = '次の植物を表す漢字の読みを答えなさい。';

KANJI[0][0] = new Array("石蓴","藜","菖蒲","薊","巻柏(「けんぱく」以外で)","忍冬","巻丹(「けんたん」以外で)",
				  "海髪","苜蓿(「もくしゅく」以外で)","巻耳(「けんじ」以外で)","牛膝(「ごしつ」以外で)","凸柑",
				  "鳶尾(「えんび」以外で)","酢漿草(「そじょうそう」以外で)","酸漿:鬼灯","薇","薺",
				  "満天星(「まんてんせい」以外で)","朮","馬酔木(「ばすいぼく」以外で)","木通(「もくつう」以外で):通草(「つうそう」以外で)",
				  "紫雲英(「しうんえい」以外で)","羊歯(「ようし」以外で):歯朶","仙人掌(「せんにんしょう」以外で)","芥子","番紅花(「ばんこうか」以外で)","鹹草(「かんそう」以外で)",
				  "繁縷","浅葱","映日果(「えいじつか」以外で)","公孫樹(「こうそんじゅ」以外で)","犬榧","花楸樹","甘蔗(「かんしょ,かんしゃ」以外で)",
				  "車前草(「しゃぜんそう」以外で)","莎草(「しゃそう」以外で)","落葉松(「らくようしょう」以外で)","楠","茱萸(「しゅゆ」以外で):胡頽子(「こたいし」以外で)","白膠木(「はくこうぼく」以外で)",
				  "甘藷(「かんしょ」以外で)","香蕈(「こうしん」以外で)","生薑","山葵","栂","金雀児:金雀枝","雨久花(「うきゅうか」以外で)",
				  "玉蜀黍","蕃茄(「ばんか」以外で)","薯蕷(「しょよ」以外で)","瞿麦(「くばく」以外で)","楢","金縷梅(「きんるばい」以外で)",
				  "大蒜","韮","鹿尾菜:羊栖菜","蓬","陸蓮根",
				  "辣韮","蕨","蕃椒(「ばんしょう」以外で)","茴香","耶悉茗","梧桐(「ごとう」以外で)");

YOMI[0][0] = new Array("あおさ","あかざ","あやめ,しょうぶ,(そうぶ)","あざみ","いわひば,(まきかしわ)","すいかずら,にんどう","おにゆり",
				  "いぎす,おごのり,(おご),(うご)","うまごやし","おなもみ","いのこずち","ぽんかん",
				  "いちはつ","かたばみ","ほおずき,(ぬかずき),(かがち):ほおずき","ぜんまい,(のえんどう)","なずな,(はまびし)",
				  "どうだんつつじ,どうだん","おけら,(うけら),(もちあわ)","あせび,あしび,(あせぼ)","あけび",
				  "げんげ,れんげそう","しだ","サボテン","けし,からし","サフラン","あしたば,(あした)",
				  "はこべ,(はこべら)","あさぎ,あさつき","いちじく","いちょう","いぬがや","ななかまど","さとうきび",
				  "おおばこ,(おんばこ)","かやつりぐさ,(くぐ),(ささめ)","からまつ","くすのき,くす","ぐみ:ぐみ,(ひぐみ)","ぬるで,(ぬりで)",
				  "さつまいも,(いも)","しいたけ","しょうが,(しょうきょう)","わさび,(さび)","つが,とが","エニシダ","みずあおい",
				  "とうもろこし","トマト,(あかなすび)","とろろ,(やまのいも)","なでしこ","なら","まんさく",
				  "にんにく,おおびる,(おおにんにく)","にら,(みら),(かみら)","ひじき","よもぎ","オクラ",
				  "らっきょう","わらび","とうがらし","ういきょう","ジャスミン","あおぎり");

QUESTION_STR[0][1] = '次の魚介類を表す漢字の読みを答えなさい。';

KANJI[0][1] = new Array("香魚(「こうぎょ」以外で):年魚(「ねんぎょ」以外で)","嘉魚(「かぎょ」以外で)","鰤","蛸:鮹:章魚",
				  "鮖:杜父魚(「とふぎょ」以外で)","松魚(「しょうぎょ」以外で)","梭子魚","鰈","鱚","鰉",
				  "鯒:牛尾魚(「ぎゅうびぎょ」以外で)","鰆","鱸","大口魚(「たいこうぎょ」以外で)","鯐",
				  "鰰:鱩:雷魚(「らいぎょ」以外で):燭魚","鱧","鱶","鯔:鰡","鯏",
				  "鱒","翻車魚","鮑:石決明(「せっけつめい」以外で)","玉筋魚","鯊:沙魚",
				  "石首魚","旗魚","川蜷:河貝子(「かばいし」以外で)","鮴:石伏魚","鰧:虎魚(「こぎょ」以外で)",
				  "水母(「すいぼ」以外で)","鮗","溝貝","鰊:鯡",
				  "海盤車","海鞘:老海鼠","海松貝:水松貝","鱟","鮎魚女","柔魚:墨魚","牡蠣",
				  "鮠","青花魚","鰌","蠍","鮍","蛤仔");

YOMI[0][1] = new Array("あゆ","いわな","ぶり","たこ",
				  "かじか,(かじこ):かじか,(かくぶつ),(かまきり)","かつお","かます","かれい","きす","ひがい",
				  "こち","さわら","すずき","たら","すばしり",
				  "はたはた","はも,(はむ)","ふか","ぼら,(いな),(とど),(なよし):ぼら","あさり,うぐい",
				  "ます","まんぼう,(まんぼうざめ),(うきぎ)","あわび","いかなご","はぜ,(さめ),(ふかざめ),(すなふき):はぜ",
				  "いしもち","かじき","かわにな","ごり,(めばる),(まて),(こち):ごり,(いしぶし)","おこぜ",
				  "くらげ","このしろ,(ひいらぎ)","どぶがい","にしん,(かど):にしん,(はらご),(はららご)",
				  "ひとで","ほや","みるがい","かぶとがに","あいなめ","いか","かき,(ぼれい)",
				  "はや,(はえ),(はい)","さば","どじょう","さそり","かわはぎ","あさり");

QUESTION_STR[0][2] = '次の虫を表す漢字の読みを答えなさい。';

KANJI[0][2] = new Array("虻","鳳蝶(「ほうちょう」以外で)","薄翅蜉蝣","馬大頭:鬼蜻蜓","蜻蛉(「せいれい」以外で)",
				  "螳螂(「とうろう」以外で):蟷螂(「とうろう」以外で)","椿象","天牛(「てんぎゅう」以外で)","螽斯","蜥蜴(「せきえき」以外で)",
				  "蟋蟀(「しっしゅつ」以外で)","蜘蛛(「ちしゅ」以外で)","螻蛄(「ろうこ」以外で)","金亀子","虱","石竜子:蜥蜴(「せきえき」以外で)",
				  "胡蜂","瓢虫:紅娘","飛蝗(「ひこう」以外で)","豆娘","浮塵子(「ふじんし」以外で)","孑孒(かな４文字で)",
				  "大蚊(「おおか」以外で)","蝸牛(「かぎゅう」以外で)","沙蚕","条虫(「じょうちゅう」以外で)","蚰蜒(「ゆうえん」以外で)",
				  "蛞蝓(「てんゆ」以外で)","蜩","水蚤","蚯蚓(「きゅういん」以外で)","馬陸","蜚蠊",
				  "壁蝨","紙魚:衣魚");

YOMI[0][2] = new Array("あぶ,(あむ)","あげはちょう,(あげは)","うすばかげろう","おにやんま","とんぼ,かげろう,(あきず),(あきづ),(あきつ),(えんば)",
				  "かまきり:かまきり,(いもじり),(いいぼむしり)","かめむし,(くさむし)","かみきりむし,(かみきり)","きりぎりす,(しゅうし)","とかげ",
				  "こおろぎ,(きりぎりす)","くも","おけら,けら","こがねむし","しらみ","とかげ",
				  "すずめばち","てんとうむし","ばった","いととんぼ","うんか","ぼうふら,(ぼうふり)",
				  "ががんぼ","かたつむり","ごかい","さなだむし","げじげじ,げじ",
				  "なめくじ","ひぐらし,(せみ),(かなかな)","みじんこ","みみず,(めめず)","やすで","ごきぶり,(ごきかぶり)",
				  "だに","しみ");

QUESTION_STR[0][3] = '次の動物を表す漢字の読みを答えなさい。';

KANJI[0][3] = new Array("海驢","鼈","信天翁(「しんてんおう」以外で)","長尾驢",
				  "海狸(かな４文字で)","蝙蝠(「へんぷく」以外で)","膃肭臍","鰐:鱷","海馬",
				  "蒿雀:青鵐","花鶏","背黄青鸚哥","樹懶","子守熊(「こもりぐま」以外で)","飯匙倩",
				  "金糸雀(「きんしじゃく」以外で)","騾馬","羊駝","驢馬","豪猪","食蛇獣","紅鶴(「べにづる」以外で)","鳧",
				  "告天子(かな３文字で)","鸛","翡翠","鵲","三十三才",
				  "鵺:鵼","鴫","鷂","鴇:朱鷺(「しゅろ」以外で)","鴻",
				  "冬眠鼠","隼","大熊猫(「おおくまねこ」以外で)","雛(かな３文字で)");

YOMI[0][3] = new Array("あしか,(みち)","すっぽん,(べつ)","あほうどり","カンガルー",
				  "ビーバー","こうもり,(かわほり)","オットセイ","わに","たつのおとしご,とど,せいうち",
				  "あおじ:あおじ,(あおしとど)","あとり","せきせいいんこ","なまけもの","コアラ","はぶ",
				  "カナリア","らば","ラマ","ろば","やまあらし","マングース","フラミンゴ,(とき)","けり,(かも)",
				  "ひばり","こうのとり,(こう)","かわせみ,ひすい,(しょうびん)","かささぎ","みそさざい",
				  "ぬえ","しぎ","はいたか,(はしたか),(いろきじ)","とき,のがん,(つき):とき","おおとり,ひしくい,(おおがり)",
				  "やまね","はやぶさ","パンダ,(ジャイアントパンダ)","ひよこ,(ひいな)");

QUESTION_STR[0][4] = '次の物・現象を表す漢字の読みを答えなさい。';

KANJI[0][4] = new Array("鉄漿(「てっしょう」以外で)","塵箱:芥箱","蠟燭:蝋燭","御御御付け","鳩尾(「み」で始めて)",
				  "吃逆(「きつぎゃく」以外で)","雀斑(「じゃくはん」以外で)","旋毛(「せんもう」以外で)","黒子","御神籤",
				  "睫毛(「しょうもう」以外で)","帷子","鏝","如雨露","神輿","松明(「しょうめい」以外で)","蝶番",
				  "賽子:骰子","笊","鋤","鍬","三和土","束子","面皰(「めんぽう」以外で)",
				  "鑿","長押","梃子:梃","鉈","暖簾","秤",
				  "抽斗","鑢","坩堝(「かんか」以外で)","轆轤","盥","簪",
				  "鉞","鋏:剪刀(「せんとう」以外で)","鞦韆(「しゅうせん」以外で)","鹿驚","湯湯婆",
				  "七五三縄:注連縄:標縄","鉄(かな４文字で)","銅(かな４文字で)","鉱","蟀谷:顳顬(「しょうじゅ」以外で)",
				  "発条(「はつじょう」以外で):撥条(「はつじょう」以外で):弾機(「だんき」以外で)","足袋","薙刀","閂",
				  "刺青(「しせい」以外で):文身(「ぶんしん」以外で)","杮(「かき」とは別字)","貝独楽","袷","鎧",
				  "颪","霰","霞","霙","靄","飆:飄","凩",
				  "東風(「ひがしかぜ」以外で)","南風(「みなみかぜ」以外で)","西風(「にしかぜ」以外で)","褌",
				  "東雲(「とううん」以外で)","細波","颱","轌:艝:雪車:雪舟","御虎子","柩","栞","鼎",
				  "霆","霈","丁髷","足枷","櫓",
				  "四阿","筵","竹藪","篩","髑髏",
				  "囲炉裏");
				  
YOMI[0][4] = new Array("おはぐろ,かね","ごみばこ","ろうそく","おみおつけ","みぞおち,みずおち",
				  "しゃっくり,しゃくり,さくり","そばかす","つむじ,(つむじげ),(つじ)","ほくろ,(くろご)","おみくじ",
				  "まつげ","かたびら","こて","じょうろ","みこし","たいまつ","ちょうつがい",
				  "さいころ","ざる,す","すき,(くわ)","くわ","たたき","たわし","にきび,(にきみ)",
				  "のみ,(いりほが)","なげし","てこ,(てご)","なた","のれん,(のうれん),(のんれん)","はかり",
				  "ひきだし","やすり","るつぼ","ろくろ,(ろくろく)","たらい","かんざし",
				  "まさかり","はさみ,やっとこ,(つるぎ):はさみ","ぶらんこ","かかし","ゆたんぽ",
				  "しめなわ","くろがね","あかがね","あらがね,(あらかね)","こめかみ",
				  "ばね,ぜんまい:ばね,ぜんまい:ばね","たび","なぎなた","かんぬき,(かんのき)",
				  "いれずみ","こけら","べいごま,ベーゴマ,(ばいごま)","あわせ","よろい",
				  "おろし","あられ","かすみ","みぞれ","もや","つむじかぜ","こがらし",
				  "こち,(こちかぜ),(あゆ)","はえ","ならい","ふんどし,(みつ),(したばかま)",
				  "しののめ","さざなみ","たいふう","そり","おまる","ひつぎ","しおり","かなえ,てい",
				  "いかずち,(いかづち),(いなずま)","おおあめ","ちょんまげ","あしかせ","やぐら,ろ",
				  "あずまや","むしろ","たけやぶ,(たかやぶ)","ふるい","どくろ,されこうべ,しゃれこうべ",
				  "いろり");

// Q2

QUESTION_STR[1][0] = '次の漢字一文字の読みを<u>訓読みで</u>答えなさい。';

KANJI[1][0] = new Array("丫","痂(かな４文字で)","嚏(かな４文字で)","靄","鎹",
				  "瘋(かな３文字で)","拇(かな４文字で)","皸(かな４文字で):皹(かな４文字で)","熱(かな４文字で)","飆(かな５文字で)","運",
				  "屍","謀(かな５文字で)","愈(かな４文字で)","颪","古(かな４文字で)","政(かな５文字で)","好(かな３文字で)",
				  "抑(かな４文字で)","羹","脛","瞼","交",
				  "鼾","諱","嗽","項(かな３文字で)","裃","叢(かな４文字で)","軍","工(かな３文字で)","度(かな３文字で)",
				  "兵","英(かな４文字で)","永(かな４文字で)","塒(かな３文字で)","砌","跫(かな４文字で)","膾","倒(かな４文字で)",
				  "皇(かな４文字で)","孤(かな４文字で)","主(かな３文字で)","臓","単","殿(かな４文字で)",
				  "童(かな３文字で)","辺(かな３文字で):畔(かな３文字で)","齢(かな３文字で)","腕(かな３文字で)","憖(かな３文字で)","渚:汀","鈍(かな４文字で)",
				  "谺","犠","膠","掟");
				  
YOMI[1][0] = new Array("あげまき,つのがみ,ふたまた","かさぶた","くしゃみ,(くっさめ)","もや","かすがい",
				  "ずつう","おやゆび","あかぎれ,(あかがり)","ほとぼり","つむじかぜ","さだめ",
				  "しかばね,かばね","はかりごと","いよいよ","おろし","いにしえ","まつりごと","よしみ",
				  "そもそも","あつもの","すね,はぎ","まぶた,(まなぶた)","こもごも",
				  "いびき","いみな","うがい","うなじ","かみしも","くさむら","いくさ,(つわもの)","たくみ,(つかさ)","めもり,(たんび)",
				  "つわもの,(いくさ)","はなぶさ","とこしえ","とぐろ,ねぐら,(とぐら)","みぎり,(みぎん)","あしおと","なます","さかさま",
				  "すめらぎ,(すべろぎ)","みなしご","あるじ,(あろじ)","はらわた","ひとえ","しんがり",
				  "わらべ,わらわ,(わらし),(わっぱ)","ほとり","よわい","かいな,(たぶさ)","なまじ","なぎさ,みぎわ","なまくら",
				  "こだま,やまびこ","いけにえ","にかわ,にべ","おきて");
	
QUESTION_STR[1][1] = '次の漢字の読みを<u>送り仮名も含めて</u>答えなさい。';

KANJI[1][1] = new Array("嘶く","苟も","蔑む","潤びる","穿つ","凝視る","概ね","徐に",
				  "隠る(「かくる」以外で)","誂える","革める","燻る(「く」で始めて)","衒う","寛ぐ","与る","彷徨う","躊躇う",
				  "鑑みる","慮る","逞しい","屈む","悴む","窶れる","揶揄う","労る",
				  "姦しい","窘める","軋む","嘯く","齎す","躓く","五月蠅い","纏める","北叟笑む",
				  "疼く","蹲る","魘される","惟る","匿う","確り","狼狽える","凡そ",
				  "翳す","炊ぐ","忝い:辱い","躱す","際疾い","蹌踉ける:蹣跚ける","囁く:私語く","流離う","仰有る",
				  "具に","嗾ける","蓋し","狡い","論う","剰え","阿る","罹る",
				  "拗れる","拵える","囀る","掠う:攫う","萎びる","草臥れる","肖る","聳える",
				  "撓やか","饐える","頗る","誑かす","暈ける","足繁く","固より","懇ろ",
				  "倦む","能う","雖も","諫める","弄ぶ","辿る","恭しい",
				  "厭う","訝る:訝しい","蠢く","堆い","諾う","羨む","貶める","夥しい",
				  "託ける","拙い","微か:幽か","仄暗い","僅か","騙る(「だまる」以外で)","謀る","嘗て:曽て",
				  "勾引す:拐かす","痒い","萌す","漱ぐ","諄い","括れる","呉々も","蓋し",
				  "挙って","心許無い","拘泥る","刮げる","零れる","拱く","覚る",
				  "撓垂れる","須く","滾る","漲る","質す","爛れる","屯する(「とんする」以外で)","因む","訛る",
				  "夙に","妊る","鏤める","劈く","蔑ろ","靡く","凭れる:靠れる","購う:贖う",
				  "毳毳しい","咎める","謗る:誹る","嘸や","諂う","恍ける","奇しくも","後退る",
				  "朧げ","諮る","嵌める","羽撃く","苛む:嘖む","嬲る","揺蕩う","焦心たい",
				  "自惚れる:己惚れる","寧ろ","恰も","周章てる","跪く","頻りに","希う",
				  "画る","転と","微睡む","嘸や","空ろ:虚ろ","巫山戯る","執拗い",
				  "慊りない","汗湿む","厚顔しい","宛行う","仇気無い","温和しい","燥ぐ");

YOMI[1][1] = new Array("いななく,(いなく),(ころろく),(ひひらく)","いやしくも","さげすむ,(さげしむ)","ほとびる","うがつ","みつめる","おおむね","おもむろに",
				  "こもる,(なばる),(なまる)","あつらえる","あらためる","くすぶる,くゆる","てらう","くつろぐ","あずかる","さまよう","ためらう",
				  "かんがみる","おもんぱかる","たくましい","かがむ,(くぐむ),(こごむ)","かじかむ","やつれる","からかう","いたわる",
				  "かしましい","たしなめる","きしむ,(ぎしむ)","うそぶく,(うそむく)","もたらす","つまずく,(つまづく)","うるさい","まとめる,(まつめる)","ほくそえむ",
				  "うずく,(ひひく),(ひひらく),(ひいらく)","うずくまる,つくばる","うなされる","おもんみる,おもいみる","かくまう","しっかり","うろたえる","およそ",
				  "かざす","かしぐ","かたじけない","かわす","きわどい","よろける","ささやく,(つつめく),(つつやく)","さすらう","おっしゃる",
				  "つぶさに","けしかける","けだし","ずるい,こすい","あげつらう","あまつさえ","おもねる","かかる",
				  "こじれる,ねじれる","こしらえる,(こさえる)","さえずる","さらう","しなびる","くたびれる,(くたぶれる)","あやかる","そびえる",
				  "しなやか","すえる","すこぶる,(かたよる)","たぶらかす,(たぶろかす),(たらかす)","ぼける","あししげく","もとより","ねんごろ,ねもころ",
				  "あぐむ,うむ","あたう,(あとう),(よう)","いえども,(いうとも)","いさめる","もてあそぶ","たどる","うやうやしい",
				  "いとう","いぶかる:いぶかしい","うごめく,(おごめく),(むくめく)","うずたかい","うべなう","うらやむ","おとしめる","おびただしい",
				  "かこつける,ことづける","つたない,まずい","かすか","ほのぐらい","わずか,(はつか)","かたる","はかる,たばかる","かつて",
				  "かどわかす","かゆい,(かいい)","きざす","すすぐ,(くちすすぐ),(くちそそぐ),(ゆすぐ)","くどい","くびれる,くくれる","くれぐれも","けだし",
				  "こぞって","こころもとない","こだわる","こそげる","こぼれる","こまねく,こまぬく,(たむだく)","さとる",
				  "しなだれる","すべからく","たぎる","みなぎる","ただす","ただれる","たむろする","ちなむ","なまる,(あやまる)",
				  "つとに","みごもる","ちりばめる","つんざく,(さく)","ないがしろ","なびく","もたれる","あがなう",
				  "けばけばしい","とがめる","そしる","さぞや","へつらう","とぼける","くしくも","あとずさる,(あとじさる)",
				  "おぼろげ","はかる","はめる","はばたく,(はたたく)","さいなむ","なぶる","たゆたう","じれったい",
				  "うぬぼれる","むしろ,(ねんごろ)","あたかも","あわてる","ひざまずく","しきりに","こいねがう",
				  "はかる,かぎる","くるりと","まどろむ","さぞや","うつろ","ふざける","しつこい,(しつっこい)",
				  "あきたりない","あせばむ","あつかましい","あてがう","あどけない","おとなしい","はしゃぐ");

// Q3

QUESTION_STR[2][0] = '次の熟語の読みを<u>音読みで</u>答えなさい。';

KANJI[2][0] = new Array("嚢中","歪曲","女衒","蹂躙","軋轢","範疇","琴瑟",
				  "癲癇","齟齬","寂寞","静謐","辟易","末裔","困憊","襤褸","拉致",
				  "逼塞","猥褻","饒舌","贔屓","罵詈","杜撰","齷齪","一瞥",
				  "憔悴","慇懃","霹靂","吝嗇","矮小","脳震盪","獰猛","晩餐",
				  "矍鑠","耄碌","狡猾","甲冑","灌漑","彷彿:髣髴","脊椎","囲繞",
				  "艱難","研鑽","誤謬","弛緩","塵芥","拈華微笑","可塑性",
				  "燦々","穿孔","鼠蹊部","蹲踞","躊躇","蘊蓄","語彙","磊落",
				  "投擲","独擅場","咄嗟","反芻","揶揄","狼藉","胃潰瘍",
				  "蹉跌","顛末","忖度","桎梏","斡旋","稟議書","剽窃","形而上",
				  "敵愾心","鳳凰","朦朧","蓬莱","狼狽","冒涜","厭悪");

YOMI[2][0] = new Array("のうちゅう","わいきょく","ぜげん","じゅうりん","あつれき","はんちゅう","きんしつ",
				  "てんかん","そご","せきばく,(じゃくまく),(せきまく)","せいひつ","へきえき","まつえい,(ばつえい)","こんぱい","らんる","らち,(らっち)",
				  "ひっそく","わいせつ","じょうぜつ,(にょうぜつ)","ひいき,(ひき),(びし)","ばり","ずさん","あくせく,(あくさく),(あくそく)","いちべつ",
				  "しょうすい","いんぎん","へきれき","りんしょく","わいしょう","のうしんとう","どうもう","ばんさん",
				  "かくしゃく","もうろく","こうかつ","かっちゅう","かんがい","ほうふつ","せきつい","いじょう,いにょう",
				  "かんなん","けんさん","ごびゅう","しかん,(ちかん)","じんかい","ねんげみしょう","かそせい",
				  "さんさん","せんこう","そけいぶ","そんきょ,(そんこ)","ちゅうちょ","うんちく","ごい","らいらく",
				  "とうてき","どくせんじょう","とっさ","はんすう","やゆ","ろうぜき,(ろうじゃく)","いかいよう",
				  "さてつ","てんまつ","そんたく","しっこく","あっせん","りんぎしょ","ひょうせつ","けいじじょう",
				  "てきがいしん","ほうおう","もうろう","ほうらい","ろうばい","ぼうとく","えんお");

// Q4

QUESTION_STR[3][0] = '次の当て字の読みを<u>カタカナで</u>答えなさい。';

KANJI[3][0] = new Array("扁桃","拉麺","沈菜","凝乳","乾酪","卵糖",
				  "牛酪","貯古齢糖","麺麭","乾蒸餅","雲呑","喇叭","型録",
				  "火酒","混合酒","三鞭酒","曹達","葡萄酒",
				  "手風琴","土瀝青","混凝土","酒精","越列機","燐寸",
				  "極光","橄欖","風琴","自鳴琴","瓦斯","大熊猫",
				  "骨牌","甘藍","秋桜","洋杯","木栓","獅子女","煙管","虎列剌",
				  "円規","朱欒","襯衣","洋袴","鬱金香","洋墨","柯柯阿",
				  "哨吶","庭球","隧道","仮漆","洋銀","麦酒",
				  "口風琴","提琴","鳳梨","籠球","甘蕉",
				  "万寿果","排球","手巾","送球","洋琴",
				  "風信子","撞球","天鵞絨","黒死病","喞筒","硝子",
				  "檬果","莫大小","豚脂","角灯","洋灯","錻力");

YOMI[3][0] = new Array("アーモンド","ラーメン","キムチ","クリーム","チーズ","カステラ",
				  "バター","チョコレート","パン","ビスケット","ワンタン","ラッパ","カタログ",
				  "ウイスキー,ウォッカ,ブランデー","カクテル","シャンパン,シャンペン","ソーダ","ワイン",
				  "アコーディオン","アスファルト","コンクリート","アルコール","エレキ","マッチ",
				  "オーロラ","オリーブ","オルガン","オルゴール","ガス","パンダ,(ジャイアントパンダ)",
				  "カルタ","キャベツ","コスモス","コップ","コルク","スフィンクス","キセル","コレラ",
				  "コンパス","ザボン","シャツ","ズボン","チューリップ","インク,インキ","カカオ",
				  "チャルメラ,(スオナ)","テニス","トンネル","ニス,(ワニス)","ニッケル","ビール",
				  "ハーモニカ","バイオリン,ヴァイオリン","パイナップル,パインアップル","バスケットボール","バナナ",
				  "パパイア,パパイヤ","バレーボール","ハンカチ","ハンドボール","ピアノ",
				  "ヒヤシンス","ビリヤード","ビロード","ペスト","ポンプ","ガラス",
				  "マンゴー","メリヤス","ラード","ランタン","ランプ","ブリキ");
