/*
KANJI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");

YOMI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");
*/

const KANKEN = "1_ateji";
const KENTEI_NAME = "当て字(漢検１級)";
const FILE_NAME = "kanken_1_ateji"; // 「○○.html」などで使用
const GENRE = ["当て字", "外国地名"];
const GENRE_EN = ["ateji", "gaikoku"];
const Q_NUM = [20, 20, 10]; // 大問ごとの問題数
const UNIT_SCORE = [2, 2, 2]; // 大問ごとにおける一問正解の配点
const MAX_SCORE = 100; // 満点
const GOKAKU_SCORE = 90; // 合格点

let QUESTION_STR = new Array(); // 問題文＋配点
let KANJI = new Array(); // 出題漢字
let YOMI = new Array(); // 正解

// 多次元配列の生成
for (let i=0; i<10; i++) {
	QUESTION_STR[i] = new Array();
	KANJI[i] = new Array();
	YOMI[i] = new Array();
}

// Q1

QUESTION_STR[0] = '次の熟語訓・当て字の読みを答えなさい。';

KANJI[0][0] = new Array("天牛","梭魚(「梭子魚」とも)","大角豆","鬼蜻蜓","土竜","殺陣","合歓","苜蓿","翻車魚","蟋蟀",
				  "水鶏","蜥蜴","飯匙倩","虎杖","繁縷","鬼灯","海鞘","浮塵子","蟒蛇","木乃伊",
				  "掏摸(「掏児」とも)","金海鼠","葛籠","梅花皮","赤楝蛇(「山楝蛇」とも)","鹹草","番紅花","蠑螈","沓手鳥","磯魚",
				  "白地","細魚(「針魚」とも)","驀地","飛白","覆盆子","酸漿","気質","王余魚","蜉蝣","海驢",
				  "螽斯","蕃椒","虎耳草","洋酒","羊歯","老海鼠","角子(「角髪」とも)","総角","雨虎","熬海鼠",
				  "病葉","百舌(「百舌鳥」とも)","木賊","山葵","水母","似非(「似而非」とも)","朱鷺","独活","終日","終夜",
				  "雀斑","未通女","海豹(「水豹」とも)","栄螺(「拳螺」とも)","蒲公英","躑躅","飛蛩","飛蝗(「蝗虫」とも)","柘榴(「石榴」とも)","蕪菁",
				  "斑鳩","風信子","胡桃(「山胡桃」とも)","草鞋","鼴鼠","向日葵","木偶","産土","山梔子(「梔子・卮子」とも)","鵁鶄",
				  "壁虎","海胆(「海栗」とも)","囈語(「譫言」とも)","鱲子","鷦鷯","雲脂(「頭垢」とも)","橄欖","莫大小","胡頽子(「茱萸」とも)","蚰蜒",
				  "香蕈","石斑魚","公孫樹","蕁麻","石決明","翻筋斗","含嗽","衣魚(「紙魚」とも)","汗疹(「汗肬」とも)","縹緻",
				  "瞿麦","文身","眩暈","玄鳥(「乙鳥」とも)","馬酔木","燭魚(「雷魚」とも)","黄楊(「柘植」とも)","杜鵑","金雀児(「金雀枝」とも)","胡蜂",
				  "枸橘(「枳殻」とも)","羅漢柏","鼯鼠","大蒜","鮎魚女","冬眠鼠","後朝","蟷螂","通草(「木通」とも)","海蘊(「海雲」とも)",
				  "壁蝨","車前草","裲襠","甜瓜","螻蛄","木槿","発条(「撥条」とも)","弾機","朱欒(「香欒」とも)","筆頭菜",
				  "山桜桃","蟾蜍","善知鳥","椿象","金糸雀","鶤鶏","蛤仔","孑孒(「孑孑」とも)","天糸瓜(「糸瓜」とも)","以来",
				  "蜀魂","忍冬(「荵冬」とも)","紙縒(「紙撚」とも)","熨斗","壁虎","石竜子","天鵞絨","三和土","魚籠","卓袱台",
				  "鞦韆","虎落","面皰","海狸","皁莢","満天星","海扇","澪標","麺麭","八仙花",
				  "沙蚕","褞袍(「縕袍」とも)","地楡","九十九折","木菟","胡籙","四阿","鉄漿","鳩尾","紅娘",
				  "膃肭臍","燐寸","花楸樹","角鴟","醤蝦(「糠蝦」とも)","秧鶏","蛞蝓","金縷梅","鹿驚","稚鰤",
				  "下風","凌霄花","水蠆","海鷂魚","洋墨","雪花菜","木天蓼","零余子","山毛欅","響尾蛇",
				  "蝙蝠","蝌蚪","羊栖菜","釦鈕","不如帰","蹈鞴(「踏鞴」とも)","紫丁香花","罌粟","油漆","海獺",
				  "虎魚","杜若","坩堝","三鞭酒","海鼠腸","牽牛花","洋琴","顳顬(「蟀谷」とも)","蜚蠊","猟虎",
				  "羚羊","海盤車","弥撒","柳葉魚","塘蒿","辛夷","土瀝青","長尾驢","樹懶","蚯蚓",
				  "玉蜀黍","鹿尾菜","寄生木","賽子(「骰子」とも)","慈姑","鳶尾","矮鶏","珠鶏","沢瀉","通条花",
				  "雲母","洋傘(「パラソル」は漢検範囲外)","塵芥虫","歩行虫","破落戸(「無頼」とも)","洋刀(「無剣」とも)","茶梅","髑髏","馬鮫魚","勒魚",
				  "静寂(「無言」とも)","玉蕈","初中後","醢汁(「塩汁」とも)","絡新婦","素面(「白面」とも)","角力","雪踏","内障","微風",
				  "冬青","幫間","手弱女","鉄刀木","山車","草石蚕","寒蝉","吉丁虫","楽車","手斧",
				  "一寸","海螺","飛礫","心算","雀鷹(「雀鷂」とも)","紡錘","黴雨","回青橙","長吻虻","天蚕糸",
				  "瓊脂","桃花鳥","蜷局","鶏冠","七葉樹","把手","舎人","海桐花","黄蜀葵(「黄葵」とも)","等閑",
				  "就中","眉尖刀","余波","竹節虫","蝸螺","接骨木","射干玉(「野干玉」とも)","盗汗","杜松",
				  "高襟","首途","蕃瓜樹","莎草","玫瑰","竹根蛇","檜皮","家猪","番瀝青","竹麦魚",
				  "鉄脚梨","乾鰯","乾海鼠","油点草","梭尾螺","喞筒","蝸牛被","密夫","海人草(「海仁草」とも)","擬宝珠",
				  "股座","団居(「円居」とも)","虎子","針孔","鼓虫(「鼓豆虫」とも)","壬生菜","海松布","海布","繍眼児","赤目魚",
				  "磯蚯蚓","没分暁漢","晩生(「晩稲」とも)","豆腐皮","蚊母鳥","噯気","鶏児腸","円座","方頭魚","東風",
				  "袋鼠","気障","泡糖","海石榴","山茶","早生(「早稲」とも)","聒聒児","遠近","二合半","鶏冠木",
				  "綜麻","埋葬虫","黒海布","白頭鳥","甘露子","可惜","髪菜","仏掌薯","急度","汗衫","科白");

YOMI[0][0] = new Array("かみきり,かみきりむし","かます","ささげ,ささぎ","おにやんま","もぐら","たて","ねむ,ねむのき,ねぶ,ねぶのき","うまごやし","まんぼう,まんぼうざめ,うきぎ","こおろぎ",
				  "くいな","とかげ","はぶ","いたどり","はこべ,はこべら","ほおずき","ほや","うんか","うわばみ","ミイラ",
				  "すり","きんこ","つづら","かいらぎ","やまかがし","あしたば","サフラン","いもり","ほととぎす","いさな",
				  "あからさま","さより","まっしぐら","かすり","いちご","ほおずき","かたぎ","かれい","かげろう","あしか",
				  "きりぎりす","とうがらし","ゆきのした","ジン","しだ","ほや","みずら","あげまき","あめふらし","いりこ",
				  "わくらば","もず","とくさ","わさび","くらげ","えせ","とき","うど","ひねもす,ひもすがら","よもすがら",
				  "そばかす","おぼこ","あざらし","さざえ","たんぽぽ","つつじ","いなご","ばった","ざくろ","かぶ,かぶら",
				  "いかる,いかるが","ヒヤシンス","くるみ","わらじ","もぐら","ひまわり","でく","うぶすな","くちなし","ごいさぎ",
				  "やもり","うに","うわごと","からすみ","みそさざい","ふけ","オリーブ","メリヤス","ぐみ","げじげじ,げじ",
				  "しいたけ","うぐい","いちょう","いらくさ","あわび","もんどり","うがい","しみ","あせも","きりょう",
				  "なでしこ","いれずみ","めまい","つばめ","あせび,あしび","はたはた","つげ","ほととぎす","エニシダ","すずめばち",
				  "からたち,からたちばな","あすなろ,あすはひのき","むささび,ももんが","にんにく","あいなめ","やまね","きぬぎぬ","かまきり","あけび","もずく",
				  "だに","おおばこ","うちかけ","まくわうり,まくわ","けら","むくげ,もくげ","ばね,ぜんまい","ばね","ザボン","つくし",
				  "ゆすらうめ","ひき,ひきがえる,がま,がまがえる","うとう","かめむし,くさむし","カナリア","しゃも,とうまる","あさり","ぼうふら","へちま","このかた",
				  "ほととぎす","すいかずら","こより","のし","やもり","とかげ","ビロード","たたき","びく","ちゃぶだい",
				  "ぶらんこ","もがり","にきび","ビーバー","さいかち","どうだん,どうだんつつじ","ほたてがい","みおつくし,みおじるし","パン","あじさい",
				  "ごかい","どてら","われもこう","つづらおり","みみずく,ずく","やなぐい","あずまや","おはぐろ,かね","みぞおち,みずおち","てんとうむし",
				  "オットセイ","マッチ","ななかまど","みみずく","あみ","くいな","なめくじ","まんさく","かかし","わらさ",
				  "おろし","のうぜんかずら,のうぜんか,のうぜん","やご,やまめ","えい","インク,インキ","おから,きらず","またたび","むかご,ぬかご","ぶな","がらがらへび",
				  "こうもり","おたまじゃくし","ひじき","ボタン","ほととぎす","たたら","ライラック,リラ","けし","ペンキ,ペイント","らっこ",
				  "おこぜ","かきつばた","るつぼ","シャンパン,シャンペン","このわた","あさがお","ピアノ","こめかみ","ごきぶり,あぶらむし","らっこ",
				  "かもしか","ひとで","ミサ","ししゃも","セロリ","こぶし","アスファルト","カンガルー","なまけもの","みみず",
				  "とうもろこし","ひじき","やどりぎ","さい,さいころ","くわい","いちはつ","チャボ","ほろほろちょう","おもだか","きぶし",
				  "きらら","こうもり","ごみむし","おさむし,ごみむし","ごろつき","サーベル","さざんか","しゃれこうべ,されこうべ","さわら","しいら",
				  "しじま","しめじ","しょっちゅう","しょっつる","じょろうぐも","しらふ","すもう","せった","そこひ","そよかぜ",
				  "そよご","たいこもち","たおやめ","たがやさん","だし","ちょろぎ","つくつくぼうし","たまむし","だんじり","ちょうな",
				  "ちょっと","つぶ","つぶて","つもり","つみ","つむ","つゆ","だいだい","つりあぶ","てぐす",
				  "ところてん","とき","とぐろ","とさか","とち","とって","とねり","とべら","とろろあおい","なおざり",
				  "なかんずく","なぎなた","なごり","ななふし","にな","にわとこ","ぬばたま","ねあせ","ねず",
				  "ハイカラ","かどで","パパイア","かやつりぐさ,ささめ,はますげ","はまなす","ひばかり","ひわだ","ぶた","ペンキ","ほうぼう",
				  "ぼけ","ほしか","ほしこ","ほととぎす","ほらがい","ポンプ","まいまいかぶり","まおとこ","まくり","ぎぼし,ぎぼうし",
				  "またぐら","まどい","まる","めど,みず","みずすまし","みぶな","みるめ","め","めじろ","めなだ",
				  "いそめ","わからずや","おくて","ゆば","よたか","おくび","よめな","わろうだ","かながしら","こち",
				  "カンガルー","きざ","カルメラ","つばき","つばき","わせ","くつわむし","おちこち","こなから","かえで",
				  "へそ","しでむし","くろめ","ひよどり","ちょろぎ","あたら","いぎす","つくねいも","きっと","かざみ","せりふ");

KANJI[0][1] = new Array("敵娼","緑啄木鳥","水綿","満江紅","怪鴟","地血","柳葉菜","明衣","榔楡","盤領",
				  "丁翁","白辛樹","土常山","絞股藍","山慈姑","紫菜","大葉藻","退紅","苞苴","金線魚(「金糸魚」とも)",
				  "土荊芥","欠唇(「兎唇」とも)","大角草","茅膏菜","蚊母樹","縮縫","木蓮子","赤檮","鱏鰉魚","裙蔕菜",
				  "神巫","鴟尾草","黄麻","鹿蹄草","磚子苗","仙毛欅","羅漢松","水蠟樹","斥候","泛子",
				  "五加(「五加木」とも)","楊櫨木","現人","猪籠草","土当帰","連銭草","連枝草","落霜紅","白梨樹","後妻(「次妻」とも)",
				  "胞衣","黄心樹","珍珠菜","珍珠花","麻幹","清器","尺蠖(しゃくとりむし - 典拠不明)","金沸草","旋覆花","江籬",
				  "前胡","紫茉莉","海狗","小連翹","敗醬","野芝麻","荊棘","牛筋草","紅樹","花仙",
				  "槭樹","馬蹄草","火光","杜夫魚","水夫(「水手」とも)","金襖子","搗布","黄鶏","石陰子","鳩酸草",
				  "火魚","蛇舅母","海金砂","擬蠍","慈鳥","青茅","甲乙(「上下」とも)","土器","杜衡","惟神(「随神」とも)",
				  "貫木","懸鉤子","細螺(「扁螺」とも)","長寿花","半銭(「寸半」とも)","仙人帽","独脚蜂","旌節花","木五倍子","紫萼",
				  "光参","紅南瓜","蒟醬","威霊仙","傀儡(「傀儡子」とも)","白屈菜","黄連花","香橘","山白竹","馬鞭草",
				  "山藤(「蛇藤」とも)","苦参","呉桃","蔵人","桄榔(「桄榔子」とも)","海神(「海若」とも)","烏樟(「鉤樟」とも)","烏芋","野蚕","合子草",
				  "烏木","越橘","金漆","帯下","瞽女","鴨舌草","鴨跖草","小水葱","木末","海鼠子",
				  "玄参(「黒参」とも)","兄鷂","野鴉椿","楊桐","月額(「月代」とも)","三毬杖","粟米草","青箭魚","小竹","胡銅器(「響銅」とも)",
				  "松蘿","怕痒樹","紫薇","胡孫眼","山梗葉","寿光木","花柏","弱檜","牛尾菜","望潮",
				  "竜爪稗","小灰蝶","笑靨花","上枝","下枝","鞋底魚","吐綬鶏","胡蝶花","南燭","天社蛾",
				  "沿階草","白及","挙尾虫","後方","首級","白灯蛾","瑞香","接続草","問荊","酸塊",
				  "従者","生絹","天蛾","看麦娘","棠梨","石花","傴僂","鬼鍼草","剪秋羅","当薬",
				  "紫萁","若干","雀卵斑","征箭(「征矢」とも)","洋玉蘭","大芥菜","担桶","栄蘭","海燕","生計(「方便」とも)",
				  "裁着(「裁衣」とも)","水豆児","玉環菜","海鏡","不知不識","狗尾草","狼尾草","金粟蘭","水甘草","江浦草",
				  "地錦","山珊瑚","蛇菰","酸棗","瀉腹","地胆","防已","鴾毛","海嘯","光桃(「油桃」とも)",
				  "菜瓜","四照花","鷸子","何首烏","羊乳","槓杆","勾欄","草蝦","石花菜","偽瓢虫",
				  "三角楓","左右","蝘蜓","鯨波","秦皮","宿直","金線蛙","点火","草烏頭","野老",
				  "菜椿象(「菜亀虫」とも)","水葱","竹柏","山芹菜","続断","常歩","黄精","苦棟樹","黄瓜菜","滷汁",
				  "郁李","胡蘿蔔","叩頭虫","烏珠(「烏玉」とも)","女貞","仰領","和尚菜","山石榴","生血","偃松",
				  "胡枝子(「胡枝花」とも)","玉鈴花","六月雪","雁来紅","錦帯花","白楊","虎茄","黄櫨","青頭菌","紫荊",
				  "知母","牛縻","鼠麴草","蔓荊","黄槿","文珠蘭","馬銜","金花虫","一葉","三白草",
				  "廂間","枸榾","射干","石蒜","陰行草","睡蓮","睡菜","石韋","山丹","神籬",
				  "檜柏","金糸桃","顋門","曹白魚","鼓子花(「旋花」とも)","眼子菜","蒲葵","金翅雀","白花菜","款冬",
				  "酔魚草","五倍子","蘭草","鵲豆","及己","恭菜","女青","牛皮凍","巻子","靫負",
				  "染指草","行器","山小菜","人面竹","塊芋(「土芋」とも)","元宝草","斑杖","三稜草(「黒三稜」とも)","浮薔","金線草",
				  "巧婦鳥","千屈菜","扁柏","野蜀葵","省沽油","黄瑞香","益母草","船首","野木瓜(「郁子」とも)","鉄掃箒",
				  "裳階(「裳層」とも)","厚皮香","紅絹","妄榧","九面芋","鶏眼草","天名精","胡蝶樹","商陸","野山薬",
				  "暗争(「暗闘」とも)","麗春花","鱠残魚","豹脚蚊","弟鷹","兄鷹","鹿薬","噴雪花","雇仲居(「雇女」とも)","沃度丁幾",
				  "左手","右手","霍公鳥","矮鹿","満俺","英斤","苦菜","訛声","帖紙(「畳紙」とも)","春宮");

YOMI[0][1] = new Array("あいかた","あおげら","あおみどろ","あかうきくさ","よたか","あかね","あかばな","あかは,あかはとり","あきにれ","あげくび",
				  "あけび","あさがら","あまちゃ","あまちゃづる","あまな","あまのり","あまも","あらぞめ","つと,あらまき","いとよりだい",
				  "ありたそう","いぐち","いささぐさ","いしもちそう","いすのき","いせ","いたび","いちい","ちょうざめ","わかめ",
				  "いちこ","いちはつ","いちび,つなそ","いちやくそう","いぬくぐ","いぬぶな","いぬまき","いぼたのき","うかみ","うき",
				  "うこぎ","うつぎ","うつせみ","うつぼかずら","うど,のだけ","かきどおし","うまごやし","うめもどき","うらじろのき","うわなり",
				  "えな","おがたまのき","おかとらのお","ゆきやなぎ","おがら","おかわ","おぎむし","おぐるま","おぐるま","おごのり",
				  "のだけ","おしろいばな","おっとせい","おとぎりそう","おとこえし","おどりこそう","おどろ","おひしば","おひるぎ","かいどう",
				  "かえで","かきどおし","かぎろい","かくぶつ","かこ","かじかがえる","かじめ","かしわ","かせ","かたばみ",
				  "かながしら","かなへび","かにくさ","かにむし","からす","かりやす","かるめる","かわらけ","かんあおい","かんながら",
				  "かんぬき","きいちご","きさご","きずいせん","きなか","きぬがさたけ","きばち","きぶし","きぶし","ぎぼうし",
				  "きんこ","きんとうが","キンマ","くがいそう","くぐつ","くさのおう","くされだま","くねんぼ","くまざさ","くまつづら",
				  "くまやなぎ","くらら","くるみ","くろうど,くらんど","くろつぐ","わたつみ,わだつみ","くろもじ","くわい","くわご","ごきづる",
				  "こくたん","こけもも","こしあぶら","こしけ","ごぜ","こなぎ","つゆくさ","こなぎ","こぬれ","このこ",
				  "ごまのはぐさ","このり","ごんずい","さかき","さかやき","さぎちょう","ざくろそう","さごし","ささ","さはり",
				  "さるおがせ","さるすべり","さるすべり","さるのこしかけ","さわぎきょう","さわぐるみ","さわら","さわら","しおで","しおまねき",
				  "しこくびえ","しじみちょう","しじみばな","ほつえ","しずえ","したびらめ","しちめんちょう","しゃが","しゃしゃんぼ","しゃちほこが",
				  "じゃのひげ","しらん","しりあげむし","しりえ","しるし","しろひとり","じんちょうげ","すぎな","すぎな","すぐり",
				  "ずさ","すずし","すずめが","すずめのてっぽう","ずみ","せ","せむし,くぐせ","せんだんぐさ","せんのう","せんぶり",
				  "ぜんまい","そこばく,そくばく","そばかす","そや","たいさんぼく","たかな","たご","たこのき","たこのまくら","たつき,たずき",
				  "たっつけ","たぬきも","ちょろぎ","つきひがい","しらずしらず","えのころぐさ","ちからしば","ちゃらん","ちょうじそう","つくも",
				  "つた","つちあけび","つちとりもち","さねぶとなつめ","くだりばら","つちはんみょう","つづらふじ","つきげ","つなみ","つばいもも",
				  "つけうり","やまぼうし","つぶり","つるどくだみ","つるにんじん","てこ","てすり","てながえび","てんぐさ","てんとうむしだまし",
				  "とうかえで","とかく","とかげ","とき","とねりこ","とのい","とのさまがえる","とぼし","とりかぶと","ところ",
				  "ながめ","なぎ","なぎ","なべな","なべな","なみあし","なるこゆり","にがき","にがな","にがり",
				  "にわうめ","にんじん","ぬかずきむし","ぬばたま","ねずみもち","のけくび","のぶき","のぼたん","のり","はいまつ",
				  "はぎ","はくうんぼく","はくちょうげ","はげいとう","はこねうつぎ","はこやなぎ","はしりどころ","はぜのき","はつたけ","はなずおう",
				  "はなすげ","はなづら","ははこぐさ","はまごう","はまぼう","はまゆう","はみ","はむし","はらん","はんげしょう",
				  "ひあわい","ひいらぎ","ひおうぎ","ひがんばな","ひきよもぎ","ひつじぐさ","みつがしわ","ひとつば","ひめゆり","ひもろぎ",
				  "びゃくしん","びようやなぎ","ひよめき","ひら","ひるがお","ひるむしろ","びろう","ひわ","ふうちょうそう","ふき,やまぶき",
				  "ふじうつぎ","ふし","ふじばかま","ふじまめ","ふたりしずか","ふだんそう","へくそかずら","へくそかずら","へそ","ゆげい",
				  "ほうせんか","ほかい","ほたるぶくろ","ほていちく","ほど","ほとけのざ","まむしぐさ","みくり","みずあおい","みずひき",
				  "みそさざい","みそはぎ","ひのき","みつば","みつばうつぎ","みつまた","めはじき","みよし","むべ","めどはぎ",
				  "もこし","もっこく","もみ","もみ","やつがしら","やはずそう","やぶたばこ","やぶでまり","やまごぼう","やまのいも",
				  "だんまり","ひなげし","しらうお","やぶか","だい","しょう","ゆきざさ","ゆきやなぎ","やとな","ヨードチンキ",
				  "ゆんで","めて","ほととぎす","まめじか","マンガン","ポンド","のげし","だみごえ","たとうがみ","とうぐう");

KANJI[0][2] = new Array("窃衣","水蠟樹蠟虫","金瘡小草","編木","落葵","礬水","槐葉蘋","鴉葱","樗蚕","蚕簿(「射翳」とも)",
				  "海州常山","見風乾","窩主","荷包牡丹","拍板","桃金嬢","王不留行","蟹足腫","麻葉繡毬","乾児",
				  "銚子","南五味子","遮莫","大戟","身柱(「天柱」とも)","天青地白","金魚蝨(「魚蝨」とも)","蜀椒","烏臼","野菰",
				  "水鼈","左義長","玉蘭","馬尾毛","爆米","瓶爾小草","陰地蕨","蛇牀","蜘蛛抱蛋","刺楸",
				  "紫参","杠谷樹","石松","小舌","漏蘆","赤栴檀","白英","山蘭","憑坐","八角金盤",
				  "蕎麦葉貝母","側金盞花","景天","釵子股","両下","玉柏","鐙靼","完骨","行縢","金剛纂",
				  "腸線","虎掌","髫髪","十大功労","貫衆","長庚","尸童","洋妾","池溝","移徙",
				  "菟糸","鼠李","沢漆","爵牀","百両金","憑子","東風菜","狗舌草","君遷子","績麻",
				  "小角","大角","主水","僂麻質斯","臭牡丹樹","山蘿蔔","銚釐","仙蓼","灯台木","松楊",
				  "頑癬","白禿瘡(「白癬」とも)","傴僂","建蘭","小櫱","聞道(「聞説」とも)","規尼涅","弧光灯","贖児","朝臣");

YOMI[0][2] = new Array("やぶじらみ","いぼたろうむし","きらんそう","びんざさら","つるむらさき","どうさ","さんしょうも","しらいとそう","しんじゅさん","まぶし",
				  "くさぎ","あかしで","けいず","けまんそう","びんざさら","てんにんか","どうかんそう","ケロイド","こでまり","こぶん",
				  "さしなべ,さすなべ","さねかずら","さもあらばあれ","たかとうだい","ちりけ","ちちこぐさ","ちょう","なるはじかみ,さんしょう","なんきんはぜ","なんばんぎせる",
				  "とちかがみ","どんど","はくもくれん","ばす","はぜ","はなやすり","はなわらび","はまぜり","はらん","はりぎり",
				  "はるとらのお","ひいらぎ","ひかげのかずら","ひこ","ひごたい","ひめしゃら","ひよどりじょうご","ひよどりばな","よりまし","やつで",
				  "うばゆり","ふくじゅそう","べんけいそう","ぼうらん","まや","まんねんすぎ","みずお","みみせせ,せせ","むかばき","やつで",
				  "ガット","うらしまそう","うない","ひいらぎなんてん","やぶそてつ","ゆうずつ,ゆうつず","よりまし","らしゃめん","うなて","わたまし",
				  "ねなしかずら","くろうめもどき","とうだいぐさ","きつねのまご","からたちばな","たのもし","しらやまぎく","さわおぐるま","しなのがき","うみお,うみそ",
				  "くだのふえ","はらのふえ,はら","もんど","リウマチ","くさぎ","まつむしそう","ちろり","われもこう","みずき","ちしゃのき",
				  "たむし","しらくも","せむし,くぐせ","するがらん","めぎ","きくならく","キニーネ","アークトウ","あがちご","あそん");

// 外国地名

QUESTION_STR[1] = '次の外国地名の読みを答えなさい。';

KANJI[1][0] = new Array("愛斯蘭","愛蘭","阿爾及",
				  "英吉利","伊色剌","烏克蘭","宇柳具","埃及",
				  "墺太利","和蘭","幾肉亜",
				  "玖馬","希臘","牙買加","新嘉坡",
				  "瑞西","瑞典","蘇丹","西班牙",
				  "丁抹","独逸","土耳古","新西蘭",
				  "泥婆羅","諾威","巴羅貝","洪牙利","比律賓",
				  "芬蘭","仏蘭西","勃牙利","越南",
				  "秘露","白耳義","波蘭","葡萄牙",
				  "墨西哥","露西亜","莫臥児",
				  "雅典","亜馬生",
				  "英蘭","維納","牛津",
				  "改羅","甲谷佗","瓜姆",
				  "角布","剣橋","高加索","戈壁","古倫母",
				  "撒哈拉","聖市","桑港","舎路",
				  "悉徳尼","爪哇","寿府","蘇素","蘇格蘭",
				  "士篤恒","聖路易","得撒","多倫多","新英土",
				  "紐瀬流","紐育","巴古達(「報達」とも)","聖林","布哇",
				  "晩克坡","漢堡","費府",
				  "伯林","澳門","馬徳里","馬耳塞",
				  "米西西皮","閔行","莫斯科","欧羅巴",
				  "羅馬","羅府","路照","倫敦","華盛頓");

YOMI[1][0] = new Array("アイスランド","アイルランド","アルジェリア",
				  "イギリス","イスラエル","ウクライナ","ウルグアイ","エジプト",
				  "オーストリア","オランダ","ギニア",
				  "キューバ","ギリシャ","ジャマイカ","シンガポール",
				  "スイス","スウェーデン","スーダン","スペイン",
				  "デンマーク","ドイツ","トルコ","ニュージーランド",
				  "ネパール","ノルウェー","パラグアイ","ハンガリー","フィリピン",
				  "フィンランド","フランス","ブルガリア","ベトナム",
				  "ペルー","ベルギー","ポーランド","ポルトガル",
				  "メキシコ","ロシア","モンゴル",
				  "アテネ","アマゾン",
				  "イングランド","ウィーン,ウイーン","オックスフォード",
				  "カイロ","カルカッタ","グアム",
				  "ケープタウン","ケンブリッジ","コーカサス","ゴビ","コロンボ",
				  "サハラ","サンパウロ","サンフランシスコ","シアトル",
				  "シドニー","ジャワ","ジュネーブ","スエズ","スコットランド",
				  "ストックホルム","セントルイス","テキサス","トロント","ニューイングランド",
				  "ニュージャージー","ニューヨーク","バグダッド","ハリウッド","ハワイ",
				  "バンクーバー","ハンブルク","フィラデルフィア",
				  "ベルリン","マカオ","マドリード","マルセイユ",
				  "ミシシッピ","ミュンヘン","モスクワ","ヨーロッパ",
				  "ローマ","ロサンゼルス","ロッテルダム","ロンドン","ワシントン");
