/*
KANJI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");

YOMI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");
*/

const KANKEN = "1_jukugo";
const KENTEI_NAME = "熟語の読み(漢検１級)";
const FILE_NAME = "kanken_1_jukugo"; // 「○○.html」などで使用
const GENRE = ["音読み", "訓読み"];
const GENRE_EN = ["onyomi", "kunyomi"];
const Q_NUM = [20, 20, 10]; // 大問ごとの問題数
const UNIT_SCORE = [2, 2, 2]; // 大問ごとにおける一問正解の配点
const MAX_SCORE = 100; // 満点
const GOKAKU_SCORE = 90; // 合格点

let QUESTION_STR = new Array(); // 問題文＋配点
let KANJI = new Array(); // 出題漢字
let YOMI = new Array(); // 正解

// 多次元配列の生成
for (let i=0; i<10; i++) {
	QUESTION_STR[i] = new Array();
	KANJI[i] = new Array();
	YOMI[i] = new Array();
}

// 音読み

QUESTION_STR[0] = '次の漢字の読みを<u>音読みで</u>答えなさい。';

KANJI[0][0] = new Array("邯鄲","咄嗟","無辜","明礬","闖入","鞏固","書肆","沽券","蹲踞","涵養",
				  "鼾声","慫慂","桎梏","傀儡","獰鱗","乂安","藹然","践祚","収斂","袂接",
				  "孤犢","良賈","玲瓏","逕庭","鳳嘴","破風","顰蹙","目睫","儁傑","虧盈",
				  "欷歔","繻子","痊癒","瓔珞","炊爨","象嵌","兀然","縲絏","麤笨","邀撃",
				  "耳朶","甄陶","跪拝","衙門","山巓","闔国","浮萍","街衢","龕灯","塵埃",
				  "昇汞","粗鹵","縹渺","余喘","進陟","白皙","巻帙","不憫","微恙","僻陬",
				  "贅言","姚冶","万斛","盥漱","噬臍","羈束","靉靆","悚懼","誄文","聿修",
				  "廓寥","登攀","奕奕","倉廩","社稷","馬謖","蘊蓄","苞苴","斗筲","瓦礫",
				  "齷齪(「偓促」とも)","茆茨","悖戻","荊棘","掉尾","生擒","眷属","毛氈","懊悩","煢然",
				  "獺祭","諤諤","鍼灸","熾烈","屎尿","謦咳","残滓","瞻望","須臾","酥酪",
				  "螽斯","琳琅","紛紜","炳乎","怡楽","薏苡","岫雲","揣摩","匏瓜","瑇瑁",
				  "鶴唳","擅権","戮力","鎖鑰","隴畝","嬋娟","剽軽","哂笑","蠕動","灰燼",
				  "韃靼","落魄","嫋嫋","棕櫚","容喙","驕奢","闡明","魑魅","毫釐","皁絹",
				  "愧赧","指嗾","双璧","睚眥","幽邃","素襖","阨狭","案牘","牛頭","器皿",
				  "短雋","羔羊","一臠","臥榻","謹飭","壊死","徼幸","肯綮","稀覯","獅子吼",
				  "囲繞","茘枝","雕琢","忠謇","昵懇(「入魂」とも)","眈々","宝匣","鵝鴨","緞帳","俎上",
				  "掣肘","瑪瑙","瀰漫","馥郁","慇懃","戯謔","猜疑","梵唄","孵卵","末裔",
				  "瑩徹","剴切","賻儀","冀求","操觚","燔書","改刪","夭逝","駘蕩","稠密(「綢密」とも)",
				  "吝嗇","涓滴","萎靡","虹霓","草莽","艟艨","磊落","辺鄙","夥多","穿鑿");
					  
YOMI[0][0] = new Array("かんたん","とっさ","むこ","みょうばん","ちんにゅう","きょうこ","しょし","こけん","そんきょ,(そんこ)","かんよう",
				  "かんせい","しょうよう","しっこく","かいらい","どうりん","がいあん","あいぜん","せんそ","しゅうれん","べいせつ",
				  "ことく","りょうこ","れいろう","けいてい","ほうし","はふ","ひんしゅく","もくしょう","しゅんけつ","きえい",
				  "ききょ","しゅす","せんゆ","ようらく","すいさん","ぞうがん,ぞうかん","こつぜん","るいせつ","そほん","ようげき",
				  "じだ","けんとう","きはい","がもん","さんてん","こうこく","ふへい","がいく","がんとう,がんどう","じんあい",
				  "しょうこう","そろ","ひょうびょう","よぜん","しんちょく","はくせき","かんちつ","ふびん","びよう","へきすう",
				  "ぜいげん","ようや","ばんこく","かんそう","ぜいせい","きそく","あいたい","しょうく","るいぶん","いっしゅう",
				  "かくりょう","とうはん,とはん","えきえき","そうりん","しゃしょく","ばしょく","うんちく","ほうしょ","としょう,とそう","がれき",
				  "あくせく,あくさく","ぼうし","はいれい","けいきょく","とうび,ちょうび","せいきん","けんぞく","もうせん","おうのう","けいぜん",
				  "だっさい","がくがく","しんきゅう","しれつ","しにょう","けいがい","ざんし","せんぼう","しゅゆ","そらく",
				  "しゅうし","りんろう","ふんうん","へいこ","いらく","よくい,よくし","しゅううん","しま","ほうか","たいまい",
				  "かくれい","せんけん","りくりょく","さやく","ろうほ","せんけん,せんえん","ひょうきん","しんしょう","ぜんどう,じゅどう","かいじん",
				  "だったん","らくはく,らくばく,らくたく","じょうじょう","しゅろ","ようかい","きょうしゃ","せんめい","ちみ","ごうり","そうけん",
				  "きたん","しそう","そうへき","がいさい","ゆうすい","すおう","あいきょう","あんとく","ごず","きべい",
				  "たんしゅん","こうよう","いちれん","がとう","きんちょく","えし","きょうこう,ぎょうこう","こうけい","きこう","ししく",
				  "いじょう,いにょう","れいし","ちょうたく","ちゅうけん","じっこん","たんたん","ほうこう","がおう","どんちょう","そじょう",
				  "せいちゅう","めのう","びまん","ふくいく","いんぎん","ぎぎゃく","さいぎ","ぼんばい","ふらん","まつえい",
				  "えいてつ","がいせつ","ふぎ","ききゅう","そうこ","はんしょ","かいさん","ようせい","たいとう","ちゅうみつ",
				  "りんしょく","けんてき","いび","こうげい","そうもう,そうぼう","どうもう","らいらく","へんぴ","かた","せんさく");

KANJI[0][1] = new Array("岑壑","譖毀","冉冉","鏗鏘","舛馳","輦轂","冢宰","瞋恚","勿翦","提撕",
				  "鶩列","戛然","炯眼","万朶","欸乃","羈絏","救恤","溝洫","巫覡","凍餒",
				  "忌諱","沐猴","巫蠱","尨然","擣衣","釁端","守圉","兵燹","貶謫","筐筥",
				  "倏忽","怱忙","黜陟","轡銜","咫尺","薤上","鯨鯢","聚斂","偃蹇","高甍",
				  "躑躅","麾下","鬚髥","褫奪","枳棘","羸馬","醇醴","愍焉","癸亥","闃然",
				  "瀟灑(「瀟洒」とも)","芳卉","贄敬","遒勁","輓近","擡挙","露簟","簪笏","牖中","諠鬧",
				  "刳磔","譎詐","謗嗤","藜羹","慳嗇","譌言","罅隙","佇眄","抃舞","袞竜",
				  "黔首","灑掃","彝倫","采椽","打嚏","杳杳","嫩芽","酒盞","鍾馗","輸贏",
				  "棗栗","大逵","蠱惑","粉膩","封豕","誣罔","讒謗","耿然","惆悵","愆尤",
				  "飆塵","考覈","七竅","丫鬟","麕集","題簽","滌蘯","鼕鼕","掩翳","流謫",
				  "鑰匣","貂裘","諂佞","打擲","噎嘔","滓穢","跼躅","篳篥","黠鼠","巨擘",
				  "流眄","頤使","麋鹿","齠齔","籌筴","過郤","卮酒","紐釦","舳艫","蠹虫",
				  "鰥寡","綢繆","殄熄","醯醢","烏鵲","泛泛","聊啾","耆艾","枳殻","巾幗",
				  "馳騁","蹣跚","樊籠","巌牆","簪筓","秉燭","蜂蠆","輜重","鼎俎","箜篌",
				  "瀛海","発兌","倥偬","豢養","諂諛","擺脱","矍鑠","感孚","管籥","外舅",
				  "庠序","白堊","月鼈","巉厳","蛇蠍","崔嵬","韜略","飫聞","砌下","覬覦",
				  "蒼氓","禁遏","澆漓","警蹕","闕下","贍給","懐孕","曩祖","和煦","午餉",
				  "醵金","羈縻","跼蹐","芥蔕","嚠喨","胡狄","螫毒","袒裼","兵站","屯蹇",
				  "蹉躓","游弋","燮理","卓犖","壊疽","鄙俗","澎湃","摶飯","鏖殺","朝暾",
				  "濁醪","敗衄","山墅","蜑戸","蝉蛻","大纛","煎熬","撃柝","搏闘","猖獗",
				  "匱乏","恬澹","棺椁","壅塞","筮卜","腥羶","遐陬","皺襞","賚賜","荼毘",
				  "鷸蚌","黼黻","斫断","糴糶","大圜","戍卒","碓舂","簷滴","輒然","翕然",
				  "汨羅","汨没","崎嶇","彗孛","六衢","潺湲","匕鬯","麈尾","麌麌","靺鞨",
				  "瓊葩","鐫録","鬩牆","栩栩然","潸潸","喟然","蛙黽","黽勉","懋勲","霆霓",
				  "藐焉","藐視","貧窶","甌窶","薫蕕","豈楽","襁褓","包裹","鴟梟","苺苔");

YOMI[0][1] = new Array("しんがく","しんき","ぜんぜん","こうそう","せんち","れんこく","ちょうさい","しんい,しんに","ぶっせん","ていせい,ていぜい",
				  "ぼくれつ","かつぜん","けいがん","ばんだ","あいだい,あいない","きせつ","きゅうじゅつ","こうきょく","ふげき","とうだい,とうたい",
				  "きき","もっこう","ふこ","ぼうぜん","とうい","きんたん","しゅぎょ","へいせん","へんたく","きょうきょ",
				  "しゅっこつ,しゅくこつ","そうぼう","ちゅっちょく","ひかん","しせき","かいじょう","げいげい","しゅうれん","えんけん","こうぼう",
				  "てきちょく","きか","しゅぜん","ちだつ","ききょく","るいば","じゅんれい","びんえん","きがい","げきぜん",
				  "しょうしゃ","ほうき","しけい","しゅうけい","ばんきん","たいきょ","ろてん","しんこつ","ゆうちゅう","けんどう,けんとう",
				  "こたく","けっさ","ぼうし","れいこう","けんしょく","かげん","かげき","ちょべん","べんぶ","こんりょう",
				  "けんしゅ","さいそう","いりん","さいてん","だてい","ようよう","どんが","しゅさん","しょうき","しゅえい",
				  "そうりつ","たいき","こわく","ふんじ","ほうし","ふもう","ざんぼう","こうぜん","ちゅうちょう","けんゆう",
				  "ひょうじん","こうかく","しちきょう","あかん","くんしゅう","だいせん","できとう,(てきとう)","とうとう","えんえい","るたく,(りゅうたく)",
				  "やっこう,やくこう","ちょうきゅう","てんねい","ちょうちゃく","えつおう","しわい","きょくちょく","ひちりき,ひつりつ","かっそ","きょはく",
				  "りゅうべん","いし","びろく","ちょうしん","ちゅうさく","かげき","ししゅ","ちゅうこう","じくろ","とちゅう",
				  "かんか","ちゅうびゅう","てんそく","けいかい","うじゃく","はんぱん","りょうしゅう","きがい","きこく","きんかく",
				  "ちてい","まんさん,はんさん","はんろう","がんしょう","しんけい","へいしょく","ほうたい","しちょう","ていそ","くご,こうこう",
				  "えいかい","はつだ","こうそう","かんよう","てんゆ","はいだつ","かくしゃく","かんぷ","かんやく","がいきゅう",
				  "しょうじょ","はくあ","げつべつ","ざんがん","だかつ","さいかい","とうりゃく","よぶん","せいか","きゆ",
				  "そうぼう","きんあつ","ぎょうり","けいひつ","けっか","せんきゅう","かいよう","のうそ","わく","ごしょう",
				  "きょきん","きび","きょくせき","かいたい","りゅうりょう","こてき","せきどく","たんせき","へいたん","ちゅんけん",
				  "さち","ゆうよく","しょうり","たくらく","えそ","ひぞく","ほうはい","たんぱん","おうさつ","ちょうとん",
				  "だくろう","はいじく","さんしょ","たんこ","せんぜい","たいとう,(だいとう)","せんごう","げきたく","はくとう","しょうけつ",
				  "きぼう","てんたん","かんかく","ようそく","ぜいぼく","せいせん","かすう","しゅうへき","らいし","だび",
				  "いつぼう","ほふつ,ふふつ","しゃくだん","てきちょう","たいえん","じゅそつ","たいしょう","えんてき","ちょうぜん","きゅうぜん",
				  "べきら","こつぼつ","きく","すいはい","りっく,りくく","せんかん,せんえん","ひちょう","しゅび","ごご","まっかつ",
				  "けいは","せんろく","げきしょう","くくぜん","さんさん","きぜん","あぼう","びんべん","ぼうくん","ていげい",
				  "ばくえん","びょうし","ひんく","おうろう","くんゆう","がいらく","きょうほう","ほうか","しきょう","ばいたい");

KANJI[0][2] = new Array("愆釁","戟鐓","髦鬣","辮線襖","鐫黜","鐺鼕","蝸醢","孼嫡","酳醋","倩妝",
						"遏糴","蟶苗","驪駒","鱲子","鐃鼓","鱏鰉","珮黻","憖憖然","罍罌","竇窖",
						"丕基","丫髻","跟胥","扈畢","韞蠢","餔歠","驃犇","籒文","簫籟","謫徙",
						"躡蹤","瑇玻盞","儔儷","觚牘","簟褥","鞋韈","饕餮","衄衊","蚌蠹","貽厥",
						"齲歯","孑孒","勖勉","匳冊","貲贖","笞擽","猋猋","冕旒","冏冏","筱驂",
						"亟肄","岑嵒","芸薹","岌嶷","逗撓","蚩蚩","喞喞","孱羸","孳衍","孳孳",
						"游愒","愒時","噫欠","隈澳","靦慙","綏肆","壼奥","耨耜","齏粉","肆廛",
				  		"俶装","俶儻","懿鑠","蓍簪","酲湎","躓仆","蝸螺","喑噁","耨耜","膊脯",
				  		"欹歟","繳繞","繳弋","箍斂","柔毳","尋找","矜寡","瓠落","瓠瓢","培塿",
						"賁星","賁然","頡頏","翊翊","咆烋","黝堊","殫竭","齎送","臉嫩","東鱟",
						"和兌","偈偈","偈頌","塙覈","匱餒","匯兌","焼畬","俘馘","觜爪","芻奠");

YOMI[0][2] = new Array("けんきん","げきたい","ぼうりょう","べんせんおう","せんちゅつ","とうとう","らかい","げっちゃく","いんさく","せんしょう",
					   "あつてき","ていびょう","りく","りょうし","どうこ","じんこう","はいふつ","ぎんぎんぜん","らいおう","とうこう",
					   "ひき","あけい","こんしょ","こひつ","うんしゅん","ほせつ","ひょうほん","ちゅうぶん","しょうらい","たくし",
					   "じょうしょう","たいひさん","ちゅうとう","ことく","てんじょく","あいべつ","とうてつ","じくべつ","ぼうと","いけつ",
					   "うし,(くし)","げっきょう,(けっきょう)","きょくべん","れんさつ","ししょく","ちりゃく","ひょうひょう","べんりゅう","けいけい","しょうさん",
					   "きい","しんがん","うんたい,うんだい","きゅうぎょく","とうどう","しし","しょくしょく","せんるい","じえん","しし",
					   "ゆうけい","かいじ","あいけん","わいいく","てんざん","すいし","こんおう","どうし","せいふん","してん",
				  	   "しゅくそう","てきとう","いしゃく","ししん","ていめん","ちふ","らら","いんお","どうし","はくほ",
				  	   "いよ","きょうじょう","しゃくよく","これん","じゅうぜい","じんそう","かんか","かくらく","こひょう","ほうろう",
					   "ほんせい","ひぜん","けっこう","よくよく","ほうこう","ゆうあく","たんけつ","しそう","けんどん","とうごう",
					   "わえつ","けつけつ","げじゅ","かくかく","きだい","かいだ","しょうしゃ","ふかく","しそう","すうてん");
// 訓読み

QUESTION_STR[1] = '次の漢字の読みを<u>訓読みで(送り仮名も含めて)</u>答えなさい。';

KANJI[1][0] = new Array("鏤める","綰ねる","祟り","鹹い","拵える","炙る","擒える","憚る","煖かい","猥ら",
					"洵に","悴む","偖(「―、話は変わって」)","躄る","躱す","憫える","孅い","狡い","魘われる","甦る",
			  		"鑢","贐(「―の言葉」)","諂う","嗄れる","捩る","鈞しい","逞しい","濘る","敲く","懈る",
			  		"覘う","噎ぶ","縢る","縢げる","聳つ","聳える","夕餉","囁く","囀る","希う",
					"睹る","彙い","糺す","咄家","節榑","窶れる","闌ける","熟(「―思う」)","揶揄う","恤れむ",
					"閾","憖(「―なことでは」)","鵜篝","鬣","霎し","寔に","噫(「―にも出さない」)","羹","椴松","縹色",
					"擅(「権力を―にする」)","颶","岨道","鱟","窘める","捫る","聊か","賚(「水は天からの―」)","屠る","錏",
					"遽しい","醪","蹼","翡翠","抉る","鬆(「―が立つ」)","馥しい","縺れる","薺粥","谺",
					"一齣(「青春の―」)","一齣(「小言を―聞かされる」)","磧","核(「―食うな」)","嬲る","釉(「―を塗る」)","娶る","訐く","裹む","慊りない",
					"謙る","鰆","藜","嘯く","繙く","幾う","幷ぶ","勠せる","暴かに","塙",
					"忽せ","塒(「―に帰る鳥」)","塒(「―を巻く」)","機(「言葉の―で」)","絶だ","粽","涵す","捏ねる","刳る","萍",
			  		"畷","鏨","翳す","論う","姑く","滾る","夾む","犒う","哭く","孕る");
				  
YOMI[1][0] = new Array("ちりばめる","たがねる,わがねる","たたり","からい,しおからい","こしらえる","あぶる","とらえる","はばかる","あたたかい","みだら",
					"まことに","かじかむ","さて","いざる","かわす","うれえる","かよわい","こすい,ずるい,わるがしこい","おそわれる","よみがえる",
			  		"やすり","はなむけ","へつらう","かれる,しわがれる","ねじる,よじる,もじる","ひとしい","たくましい","ぬかる","たたく","おこたる",
			  		"うかがう","むせぶ","かがる","からげる","そばだつ","そびえる","ゆうげ","ささやく","さえずる","こいねがう",
					"みる","たぐい","ただす","はなしか","ふしくれ","やつれる","たける","つらつら,つくづく","からかう","あわれむ",
					"しきい","なまじ","うかがり","たてがみ","しばし","まことに","おくび","あつもの","とどまつ","はなだいろ",
					"ほしいまま","つむじかぜ","そばみち,そわみち","かぶとがに","たしなめる","ひねる,(とる)","いささか","たまもの","ほふる","しころ",
					"あわただしい","もろみ,(にごりざけ),(どぶろく)","みずかき","かわせみ","えぐる","す","かんばしい","もつれる","なずながゆ","こだま,やまびこ",
					"ひとこま","ひとくさり","かわら,さばく","さね","なぶる","うわぐすり","めとる","あばく","つつむ","あきたりない",
					"へりくだる","さわら","あかざ","うそぶく","ひもとく","こいねがう,ねがう","ならぶ","あわせる","にわかに","はなわ",
					"ゆるがせ","ねぐら,とや","とぐろ","はずみ","はなはだ","ちまき","うるおす,ひたす","こねる,つくねる","くる,えぐる","うきくさ,(よもぎ)",
			  		"なわて","たがね","かざす","あげつらう","しばらく","たぎる","はさむ,さしはさむ","ねぎらう","なく","みごもる");

KANJI[1][1] = new Array("邃い","馮る","嶷い","譴める","拑む","傅く","畚","狄","桴(「―で打つ」)","桴(「―に乗る」)",
				  "邀う","鐫る","肆(「権力を―にする」)","愬える","夐かに","萼","誣い難し","鬮","蹙まる","糶(「―にかける」)",
				  "誑く","畢く","絮い","糱","昃く","晨(意味：早朝。夜明け。)","僵れる","殃い","胖か","韜む",
				  "撓める","銜む","扣く","幾何(「将―ぞ」)","候つ","咸く","孼い","絮","刮る","舂く",
				  "犢","擡げる","黜ける","龕","嗔る","苟に","蹶れる","闢く","一廉(「―の人物」)","爰に",
				  "曩に","矜れむ","矜る","倩しい","乂る","煌く","畋り","惘れる","陞る",
				  "嚮に","嚮かう","拈る","搓る","扼える","斫る","慳しむ","沽る","憔れる","螫す",
				  "訝る","截る","豢う","皙い","歔く","瞞く","謐か","虧く","吮う","毋い","毋れ",
				  "岌い","濺ぐ","搴げる","皚い","糜れる","魏い","褫う","黷す","雍らぐ","寐る",
				  "拯う","鑽る","崛つ","徙る","聚める","悛める","愍れむ","驩ぶ","眇める","紮げる",
				  "匯る","嫺やか","酖る","覲える","覘く","湎れる","殞ちる","羶い","瑣さい","矇か",
				  "歠る","愾く","箴める","詭る","侈る","掉う","戮す","渾て","洽し","圜い",
				  "撓う","檣(「船の―」)","駛い","攬る","瀝る","逋れる","噪ぐ","祚い","冏らか","刔る",
				  "燮げる","叨に","鄙しむ","緇む","慥か","愿む","徊う","霾る","愨む","耘る",
				  "迥か","狎れる","狃れる","揩う","貽す","儷ぶ","杳い","亟やか","逖い","驟か",
				  "于に","罕に","偸む","夥しい","猝か","璞","螯","燠","纜","韋");

YOMI[1][1] = new Array("ふかい,おくぶかい,とおい","よる,(いかる),(かちわたる)","たかい,さとい","せめる,とがめる","はさむ,つぐむ","かしずく,(つく)","ふご,もっこ","えびす","ばち","いかだ",
				  "むかう","ほる,える","ほしいまま","うったえる","はるかに","うてな","しいがたし","くじ","きわまる","せり",
				  "あざむく","ことごとく","くどい","もやし,こうじ","かたむく","あした","たおれる","わざわい","ゆたか","つつむ",
				  "たわめる,ためる,いためる","ふくむ","たたく","いくばく","まつ","ことごとく","わざわい","わた,わたいれ","けずる,こする","うすづく,つく",
				  "こうし","もたげる,もちあげる","しりぞける","ずし","いかる","かりそめに","たおれる","ひらく","ひとかど","ここに",
				  "さきに","あわれむ","ほこる","うつくしい","かる","かがやく","かり","あきれる","のぼる",
				  "さきに","むかう","ひねる","よる","おさえる","きる","おしむ","うる","やつれる","さす",
				  "いぶかる","きる","やしなう","しろい","すすりなく","あざむく","しずか","かく","すう","ない","なかれ",
				  "たかい","そそぐ","かかげる","しろい","ただれる","たかい","うばう","けがす","やわらぐ","ねる",
				  "すくう","きる","そばだつ","うつる","あつめる","あらためる","あわれむ","よろこぶ","すがめる","からげる",
				  "めぐる","みやびやか","ふける","まみえる","のぞく","おぼれる","おちる","なまぐさい","ちいさい","おろか",
				  "すする","なげく","いましめる","いつわる","おごる","ふるう","ころす","すべて","あまねし","まるい",
				  "しなう","ほばしら","はやい","とる","したたる","のがれる","さわぐ","さいわい","あきらか","えぐる",
				  "やわらげる","みだりに","いやしむ","くろむ","たしか","つつしむ","さまよう","つちふる","つつしむ","くさぎる",
				  "はるか","なれる","なれる","ぬぐう","のこす","ならぶ","くらい","すみやか","とおい","にわか",
				  "ここに","まれに","ぬすむ","おびただしい","にわか","あらたま","はさみ","おき","ともづな","なめしがわ");

KANJI[1][2] = new Array("哦う","聘らしむ","奚ぞ","戛つ","聒しい","攢める","溥し","慵し","鬮る","怙む",
					"兪り","偸からず","懿しい","逾える","僭る","稟ける","懽ぶ","澆い","晞く","餽る",
					"揀ける","柬ける","窩す","猾い","躋る","肄う","淬ぐ","蹻げる","瞿る","凭る",
					"訖る","呶しい","霍か","靠る","誚める","覓める","佻しい","嫩い","詬める","顫える",
					"歛む","襄る","邇い","徇える","擯ける","煦める","贍す","羸れる","扛げる","擠す",
					"亶い","劬れる","踰す","癇け","匆しい","忤うる","脩し","謾く","很る","藉く",
					"曁る","讙しい","踟う","攘う","惺る","奠める","奠る","贏る","挌る","挌つ",
					"恪む","熙らぐ","愒す","愒る","梟す","粤に","亢る","滔る","怙む","找す",
					"跎く","菲い","衍る","愆る","湍い","价い","哈る","薨る","怎で","丐う",
					"閔える","熙る","詼れる","渙ける","絎ける","曠しい","帙","秣","碣","枌");

YOMI[1][2] = new Array("うたう","めとらしむ","なんぞ","うつ","かまびすしい","あつめる","あまねし","ものうし","たたかいとる","たのむ",
					"しかり","うすからず","うるわしい","こえる","おごる","うける","よろこぶ","うすい","かわく","おくる",
					"わける","えりわける","かくす","わるがしこい","のぼる","ならう","にらぐ","あげる","みる","よる",
					"いたる","かまびすしい","にわか","よる","せめる","もとめる","かるがるしい","わかい","はずかしめる","ふるえる",
					"のぞむ","のぼる","ちかい","となえる","しりぞける","あたためる","たす","つかれる","あげる","おす",
					"あつい","つかれる","こす","ひきつけ","いそがしい","さからうる","ながし","あざむく","もとる","しく",
					"いたる","かまびすしい","ためらう","はらう","さとる","さだめる","まつる","あまる","なぐる","うつ",
					"つつしむ","やわらぐ","おどす","むさぼる","さらす","ここに","たかぶる","はびこる","たのむ","さおさす",
					"つまずく","うすい","はびこる","あやまる","はやい","よい","すする","みまかる","いかで","こう",
					"うれえる","ひかる","たわむれる","とける","くける","むなしい","ふまき","まぐさ","いしぶみ","そぎ,にれ");

