/*
KANJI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");

YOMI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");
*/

const CLASS = 6;
const KENTEI_NAME = "六級";
const FILE_NAME = "6class"; // 「○○.html」などで使用
const GENRE = ["植物", "魚介類", "鳥類", "動物", "常用熟字訓"];
const Q_NUM = [10, 10, 5]; // 大問ごとの問題数
const UNIT_SCORE = [4, 4, 4]; // 大問ごとにおける一問正解の配点
const MAX_SCORE = 100; // 満点
const GOKAKU_SCORE = 80; // 合格点

let QUESTION_STR = new Array(); // 問題文＋配点
let KANJI = new Array(); // 出題漢字
let YOMI = new Array(); // 正解

// 多次元配列の生成
for (let i=0; i<10; i++) {
	QUESTION_STR[i] = new Array();
	KANJI[i] = new Array();
	YOMI[i] = new Array();
}

// Q1

QUESTION_STR[0][0] = '次の植物を表す漢字の読みを答えなさい。';

KANJI[0][0] = new Array("杜若(「とじゃく」以外で):燕子花","糸瓜","柚子","林檎","胡瓜",
					  "撫子","向日葵","紫陽花(「しようか」以外で)","牡丹","茜","蒲公英(「ほこうえい」以外で)","芋",
					  "葵","翌檜","杏:杏子","無花果(「むかか」以外で)","独活(「どっかつ」以外で)","団栗","落花生",
					  "楓","西瓜","胡桃","牛蒡","山茶花","苺","石南花:石楠花","蜜柑","人参",
				      "葡萄","葱","薔薇","小豆","女郎花","唐辛子",
				      "万年青(「まんねんせい」以外で)","南瓜","煙草(「えんそう」以外で)","砂糖黍","土筆(「どひつ」以外で)","筍",
				      "百日紅(「ひゃくじつこう」以外で)","茄子","銀杏","柏","枇杷","菊","生姜",
					  "馬鈴薯","檸檬","梅","柿(「こけら」とは別字)",
					  "水雲(「も」から始まる):海雲(「も」から始まる)","柘榴:石榴(「せきりゅう」以外で)");
					  
YOMI[0][0] = new Array("かきつばた","へちま,(いとうり)","ゆず","りんご,(りんきん),(りゅうごう)","きゅうり,(きうり),(そばうり)",
				  "なでしこ","ひまわり,(ひゅうがあおい)","あじさい","ぼたん","あかね","たんぽぽ","いも,(うも)",
				  "あおい","あすなろ","あんず","いちじく,(いちじゅく)","うど,(つちたら)","どんぐり","らっかせい",
				  "かえで","すいか,(さいうり)","くるみ","ごぼう,(ごんぼ),(うまふぶき)","さざんか,(さんさか)","いちご","しゃくなげ","みかん,(みつかん)","にんじん,(かのにげぐさ)",
				  "ぶどう,(えび)","ねぎ,(き)","ばら,(しょうび),(そうび)","あずき,(しょうず)","おみなえし,(おみなめし)","とうがらし",
				  "おもと","かぼちゃ,(ぼぶら)","たばこ","さとうきび","つくし,(つくづくし),(つくしんぼ)","たけのこ",
				  "さるすべり","なす,なすび","ぎんなん,いちょう","かしわ,(かえ)","びわ","きく","しょうが",
				  "じゃがいも,ばれいしょ","れもん,(ねいもう),(れも)","うめ","かき",
				  "もずく,(もぞこ):もずく","ざくろ");

QUESTION_STR[0][1] = '次の魚介類を表す漢字の読みを答えなさい。';

KANJI[0][1] = new Array("烏賊","鮎","鱈","海星(「かいせい」以外で)","穴子","山椒魚",
				  "海老","河豚","鯵","鮒","海月(「かいげつ」以外で)",
				  "太刀魚","海鼠(「な」から始まる)","蛤(「は」から始まる)","公魚","山女:山女魚",
				  "眼張","鰹","鮪","秋刀魚","柳葉魚",
				  "浅蜊","鯛","鯉","鮭","泥鰌","鰯",
				  "馬刀貝","伊勢蝦","蜆(「し」から始まる)","帆立貝","蟹",
				  "栄螺(「さ」から始まる):拳螺(「さ」から始まる)","鮃","介党鱈","鯰","飛魚");
					  
YOMI[0][1] = new Array("いか","あゆ","たら","ひとで","あなご","さんしょううお",
				  "えび","ふぐ,(ふく),(ふくべ),(かとん)","あじ","ふな","くらげ",
				  "たちうお,(たちのうお)","なまこ,(こ),(かいそ)","はまぐり,(はま)","わかさぎ","やまめ",
				  "めばる","かつお","まぐろ,(しび)","さんま","ししゃも,(やなぎもろこ)",
				  "あさり","たい","こい","さけ,しゃけ,(さかな),(ふぐ)","どじょう","いわし",
				  "まてがい","いせえび","しじみ","ほたてがい","かに",
				  "さざえ,(さざい):さざえ","ひらめ","すけとうだら","なまず","とびうお,(あご)");
					  
QUESTION_STR[0][2] = '次の鳥類を表す漢字の読みを答えなさい。';
					  
KANJI[0][2] = new Array("家鴨(「あ」から始まる)","鶯(「う」から始まる)","鸚鵡","合鴨","烏(「とり」とは別字)",
				  "啄木鳥","水鶏(「すいけい」以外で)","孔雀","鷺","四十雀",
				  "鷹","鷲","駝鳥","雀","阿房鳥","音呼","鴎(「か」から始まる)",
				  "不如帰(「ふじょき」以外で)","百舌","木菟","雲雀","梟(「ふ」から始まる)",
				  "鴛鴦","郭公","鵝鳥","鶉(「う」から始まる)",
				  "鳩","十姉妹","燕(「つ」から始まる)","鳶",
				  "雉子","烏骨鶏","軽鴨","鶴","鶏");

YOMI[0][2] = new Array("あひる","うぐいす","おうむ","あいがも","からす,(う)",
				  "きつつき,(けら),(けらつつき)","くいな","くじゃく","さぎ","しじゅうから",
				  "たか","わし","だちょう","すずめ","あほうどり","いんこ","かもめ",
				  "ほととぎす","もず","みみずく,ずく","ひばり","ふくろう,(ふくろ)",
				  "おしどり,えんおう,(おし)","ほととぎす,かっこう","がちょう","うずら",
				  "はと","じゅうしまつ","つばめ,(つばくろ),(つばくら),(つばくらめ)","とび,とんび",
				  "きじ,きぎす,きぎし","うこっけい","かるがも","つる","にわとり,とり,(くた),(くたかけ)");

QUESTION_STR[0][3] = '次の動物を表す漢字の読みを答えなさい。';
					  
KANJI[0][3] = new Array("海豹(「あ」から始まる)","海豚","河馬","浣熊","食蟻獣",
				  "鼬(「い」から始まる)","猪","川獺","蝮(「ま」から始まる)","狸","狐",
				  "麒麟","鼠","犀","縞馬",
				  "儒艮","海象(「せ」から始まる)","馴鹿","豹","鯨",
				  "兎","土竜(「も」から始まる)","山羊",
				  "駱駝","栗鼠","鴨嘴");
				  
YOMI[0][3] = new Array("あざらし","いるか","かば","あらいぐま","ありくい",
				  "いたち","いのしし,(い),(しし)","かわうそ","まむし","たぬき,(たたけ),(たたげ)","きつね",
				  "きりん","ねずみ,(ねず)","さい","しまうま",
				  "じゅごん","セイウチ","トナカイ,(じゅんろく)","ひょう","くじら,(いさな),(いさ)",
				  "うさぎ,(う)","もぐら,(もぐらもち)","やぎ",
				  "らくだ","りす","かものはし");

QUESTION_STR[0][4] = '次の常用熟字訓の読みを答えなさい。';

KANJI[0][4] = new Array("小豆","海女","硫黄","意気地","田舎","息吹","大海原","乳母","叔父:伯父","乙女",
				  "叔母:伯母","神酒","母屋:母家","神楽","河岸(かな２文字で)","風邪","蚊帳","為替","玄人","雑魚",
				  "桟敷","五月晴れ","早苗","五月雨","時雨","竹刀","芝生","三味線","砂利","数珠",
				  "師走","数寄屋","草履","太刀","足袋","稚児","梅雨","凸凹","伝馬船","投網",
				  "読経","仲人","名残","雪崩","野良","祝詞","波止場","日和","吹雪","土産",
				  "猛者","紅葉","木綿","最寄り","八百長","大和","浴衣","行方","寄席","若人");

YOMI[0][4] = new Array("あずき","あま","いおう","いくじ","いなか","いぶき","おおうなばら","うば","おじ","おとめ",
				  "おば","みき","おもや,もや","かぐら","かし","かぜ","かや","かわせ","くろうと","ざこ",
				  "さじき,(さんじき)","さつきばれ","さなえ","さみだれ","しぐれ","しない","しばふ","しゃみせん","じゃり","じゅず",
				  "しわす","すきや","ぞうり","たち","たび","ちご","つゆ","でこぼこ","てんません","とあみ",
				  "どきょう","なこうど","なごり","なだれ","のら","のりと","はとば","ひより","ふぶき","みやげ",
				  "もさ","もみじ","もめん,(ゆう)","もより","やおちょう","やまと","ゆかた","ゆくえ","よせ","わこうど");

// Q2

QUESTION_STR[1][0] = '次の漢字の読みを<u>送り仮名も含めて</u>答えなさい。';

KANJI[1][0] = new Array("準える","呟く","喧しい","齧る",
					  "嘲笑う","相応しい","漸く","尖る","弁える","憧れる","醸す",
					  "予め","些か","即ち","喘ぐ","潔い","陥れる","萎む","怯える",
					  "虐げる","煽る","呷る","悼む","麗らか","脅かす","嗜む",
					  "雪ぐ","毟る","強ち","幾つ","戴く","喋る","雄叫び","図々しい",
					  "偏に","暫く","蝕む","如何わしい","掴む","漂う","薦める",
					  "宛ら","罵る","戦く","敢えて","懐く","却って",
					  "予て","紛れる","円ら","侮る","慈しむ","怠る","掲げる","窮まる","携える",
					  "扇ぐ","青褪める","傍ら","塗す","集る","色褪せる","寂しい:淋しい","抓る",
					  "諭す","唆す","蒼い","過る","憩う","覆す","佇む",
				      "呆れる","欺く","艶やか","晒す","曝す","未だ","促す","緩やか","遡る",
				      "司る","歪む","宥める","曰く","愁う","穏やか","有難い","遮る",
				      "疎い","頷く","可笑しい","厳か","厳つい","承る","冒す","口説く","堪える",
					  "奉る","戯れる","尊ぶ:貴ぶ","牛耳る","盾突く","賜る","啄む",
					  "繕う","紡ぐ","募る","弔う","滞る","戒める","尚且つ","慰める","絡む",
					  "塞ぐ","太々しい","容易い","轟く","口遊む",
					  "和える");
				  
YOMI[1][0] = new Array("なぞらえる,(なずらえる)","つぶやく","かまびすしい,やかましい","かじる,(かぶる)",
				  "あざわらう","ふさわしい","ようやく","とがる,(とんがる)","わきまえる","あこがれる","かもす",
				  "あらかじめ","いささか","すなわち","あえぐ","いさぎよい","おとしいれる","しぼむ","おびえる",
				  "しいたげる,(せたげる)","あおる","あおる","いたむ","うららか","おどかす,おびやかす","たしなむ,(たしむ)",
				  "そそぐ,すすぐ","むしる","あながち","いくつ","いただく","しゃべる","おたけび,(おさけび)","ずうずうしい",
				  "ひとえに,(かたほに)","しばらく,(しまらく)","むしばむ","いかがわしい","つかむ","ただよう","すすめる",
				  "さながら","ののしる,(のる)","おののく","あえて","なつく,(いだく),(うだく),(なずく)","かえって",
				  "かねて","まぎれる,(まぐれる)","つぶら","あなどる,(あなずる)","いつくしむ,(うつくしむ)","おこたる","かかげる","きわまる","たずさえる",
				  "あおぐ","あおざめる","かたわら","まぶす,(まめす)","たかる","いろあせる","さびしい,さみしい,(さむしい)","つねる",
				  "さとす","そそのかす,(そそなかす),(そそのわかす)","あおい","よぎる","いこう","くつがえす,(ふくす)","たたずむ",
				  "あきれる","あざむく","つややか,あでやか,(なまやか)","さらす","さらす","いまだ,まだ","うながす","ゆるやか","さかのぼる",
				  "つかさどる","ひずむ,ゆがむ,(いがむ)","なだめる","いわく,(のたまわく)","うれう","おだやか","ありがたい","さえぎる,(さいぎる)",
				  "うとい","うなずく","おかしい","おごそか","いかつい","うけたまわる","おかす","くどく","たえる,こらえる,こたえる",
				  "たてまつる,(まつる)","たわむれる,じゃれる,(たわぶれる),(ざれる)","とうとぶ,たっとぶ:とうとぶ,たっとぶ,(あてぶ)","ぎゅうじる","たてつく","たまわる,(たもる),(とうばる)","ついばむ",
				  "つくろう","つむぐ","つのる","とむらう","とどこおる","いましめる","なおかつ","なぐさめる","からむ",
				  "ふさぐ,(ひさぐ),(ふたぐ)","ふてぶてしい","たやすい","とどろく,(とどめく),(どどめく)","くちずさむ",
				  "あえる");
	
// Q3

QUESTION_STR[2][0] = '次の熟語の読みを<u>音読みで</u>答えなさい。';

KANJI[2][0] = new Array("渾身","憂鬱","昏睡","輪廻","浪漫","愛嬌","成就",
					  "彫琢","勿論","団欒","緑青","解熱","訃報","匹敵","完璧",
					  "捏造","痙攣","湾曲","漏洩","駆逐","矯正","逝去",
					  "撥水","緻密","翻弄","懸念","厳粛","安寧","奨励",
					  "惰性","壊死","溌剌","勾配","発端","秘匿","所轄","押印",
					  "辛辣","安堵","軽蔑","頒布","亀裂","御法度","怪我","虚仮","若干",
					  "颯爽","野次","肋骨","催促","怠慢","枢軸","贅沢",
					  "淘汰","抜擢","煩悩","繚乱","供養","前哨戦","凹凸",
				      "頂戴","呆然","建立(「けんりつ」以外で)","蔓延","絢爛","矛盾","勃発",
				  	  "膠着","殺戮","嗜好","復讐","左遷","抽出","横柄",
				      "血痕","骸骨","治癒","辛抱","唖然","香辛料","脅威",
					  "威嚇","阿吽","親睦","勲章","懇願","姑息","真髄","驚愕",
					  "堕落","汚濁","潤滑","裁縫","醜態","緩急","拝啓",
					  "容赦","払拭","憎悪","有頂天","呂律","凡例","喪心",
					  "轟音","稽古","翻弄","形骸化","竣工");

YOMI[2][0] = new Array("こんしん","ゆううつ","こんすい","りんね","ろまん,ろうまん","あいきょう","じょうじゅ",
				  "ちょうたく","もちろん","だんらん","ろくしょう","げねつ","ふほう","ひってき","かんぺき",
				  "ねつぞう,(でつぞう)","けいれん","わんきょく","ろうえい,(ろうせつ)","くちく","きょうせい","せいきょ",
				  "はっすい","ちみつ","ほんろう","けねん,(けんねん)","げんしゅく","あんねい","しょうれい",
				  "だせい","えし","はつらつ","こうばい","ほったん","ひとく","しょかつ","おういん",
				  "しんらつ","あんど","けいべつ","はんぷ","きれつ","ごはっと","けが","こけ","じゃっかん",
				  "さっそう","やじ","ろっこつ","さいそく","たいまん","すうじく","ぜいたく",
				  "とうた","ばってき","ぼんのう","りょうらん","くよう","ぜんしょうせん","おうとつ",
				  "ちょうだい","ぼうぜん","こんりゅう","まんえん","けんらん","むじゅん","ぼっぱつ",
				  "こうちゃく","さつりく","しこう","ふくしゅう","させん","ちゅうしゅつ","おうへい",
				  "けっこん","がいこつ","ちゆ","しんぼう","あぜん","こうしんりょう","きょうい",
				  "いかく","あうん","しんぼく","くんしょう","こんがん","こそく","しんずい","きょうがく",
				  "だらく","おだく","じゅんかつ","さいほう","しゅうたい","かんきゅう","はいけい",
				  "ようしゃ","ふっしょく,(ふっしき)","ぞうお","うちょうてん","ろれつ,(りょりつ)","はんれい","そうしん",
				  "ごうおん","けいこ","ほんろう","けいがいか","しゅんこう");
