/*
KANJI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");

YOMI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");
*/

const KANKEN = "jun1_jukugo";
const KENTEI_NAME = "熟語の読み(漢検準１級)";
const FILE_NAME = "kanken_jun1_jukugo"; // 「○○.html」などで使用
const GENRE = ["音読み", "訓読み"];
const GENRE_EN = ["onyomi", "kunyomi"];
const Q_NUM = [20, 20, 10]; // 大問ごとの問題数
const UNIT_SCORE = [2, 2, 2]; // 大問ごとにおける一問正解の配点
const MAX_SCORE = 100; // 満点
const GOKAKU_SCORE = 90; // 合格点

let QUESTION_STR = new Array(); // 問題文＋配点
let KANJI = new Array(); // 出題漢字
let YOMI = new Array(); // 正解

// 多次元配列の生成
for (let i=0; i<10; i++) {
	QUESTION_STR[i] = new Array();
	KANJI[i] = new Array();
	YOMI[i] = new Array();
}

// 音読み

QUESTION_STR[0] = '次の漢字の読みを<u>音読みで</u>答えなさい。';

KANJI[0][0] = new Array("横溢","凄惨","怨念","憾怨","俄然","蘇生","掌篇","灼熱","凌駕","歪曲",
				  		"葛藤","晦朔","椿寿","区劃","払拭","堆積","凋残","鼎談","廟堂","一瞥",
				  		"庖厨","掬水","謬見","咽喉","咽下","袖珍","謙遜","肇国","豊頬","鬱勃",
				  		"牙城","晦渋","兜巾","厩舎","詣拝","野狐","燦燦","播植","袈裟","膝下",
				  		"馴致","吻合","老爺","怒濤","遡行","茅舎","饗宴","牢守","挽車","翻弄",
				  		"靭帯","倦怠感","佳肴","魁傑","咳唾","狐狸","曳航","汚瀆","葛衣","蓋世",
				  		"沃土","形骸","拳固","阿片窟","宥恕","恩誼","白狐","尖兵","塵芥","残蟬",
				  		"蕩尽","贋造","縞素","煽動","侮蔑","画餅","敦信","鴻毛","頓挫","歎声",
				  		"筆鋒","牡丹","蔽護","弘毅","編輯","慰撫","馨香","欣快","跨線橋","串殺",
				  		"寓意","稽古","岨峻","杜絶","禿筆","惇朴","揃刈","攪乱","汀渚","櫛比",
				  		"紐帯","枕頭","脇息","艶冶","補綴","摺扇","釣鉤","伽羅","叶和","擾乱",
						"勾引","耽読","悉皆","岡陵","刺繍","律呂","弘誓","撞着","綾羅","城砦");
					  
YOMI[0][0] = new Array("おういつ","せいさん","おんねん","かんえん","がぜん","そせい","しょうへん","しゃくねつ","りょうが","わいきょく",
				  		"かっとう","かいさく","ちんじゅ","くかく","ふっしょく,ふっしき","たいせき","ちょうざん","ていだん","びょうどう","いちべつ",
				  		"ほうちゅう","きくすい","びゅうけん","いんこう","えんか,えんげ","しゅうちん","けんそん","ちょうこく","ほうきょう","うつぼつ",
				  		"がじょう","かいじゅう","ときん","きゅうしゃ","けいはい","やこ","さんさん","はしょく","けさ","しっか",
				  		"じゅんち","ふんごう","ろうや","どとう","そこう","ぼうしゃ","きょうえん","ろうしゅ","ばんしゃ","ほんろう",
				  		"じんたい","けんたいかん","かこう","かいけつ","がいだ","こり","えいこう","おとく","かつい","がいせい",
				  		"よくど","けいがい","げんこ","あへんくつ","ゆうじょ","おんぎ","びゃっこ","せんぺい","じんかい","ざんせん",
				  		"とうじん","がんぞう","こうそ","せんどう","ぶべつ","がべい,がへい","とんしん","こうもう","とんざ","たんせい",
				  		"ひっぽう","ぼたん","へいご","こうき","へんしゅう","いぶ","けいこう","きんかい","こせんきょう","せんさつ",
				  		"ぐうい","けいこ","そしゅん","とぜつ","とくひつ","じゅんぼく","せんがい","かくらん,こうらん","ていしょ","しっぴ",
				  		"ちゅうたい,(じゅうたい)","ちんとう","きょうそく","えんや","ほてつ,ほてい","しょうせん","ちょうこう","きゃら","きょうわ","じょうらん",
						"こういん","たんどく","しっかい","こうりょう","ししゅう","ろれつ","ぐぜい","どうちゃく","りょうら","じょうさい");

KANJI[0][1] = new Array("誰何","茅茨","衣袴","胡乱","砥礪","牟食","翰墨","正閏","熊掌","夙起",
					    "堆朱","頁岩","爪牙","鞠問","莫春","荻花","邑落","稲粟","翫弄","爾後",
					    "二竪","無碍","烏有","薬匙","有卦","卦辞","卦体","急灘","莞爾","烏兎",
					    "嬰鱗","掩蓋","仰臥","不屑","蚤起","弥縫","黛青","偏頗","巽位","俗諺",
					    "僻遠","佳辰","烏鷺","揖拝","甥姪","錫杖","葛瓜","赫灼","聡慧","智慧",
					    "亀卜","豊稔","尤物","沃饒","憂悶","厩肥","厭離","倦厭","兜率天","好好爺",
						"樗材","曾遊","鉤餌","鹿柴","廠舎","絢飾","象箸","拭浄","戎馬","鶯遷",
						"衣桁","儲君","孜孜","太閤","却火","敦朴","曝書","穿柳","丞相","垢衣",
						"弓箭","豎子","雌蕊","耶蘇","風鐸","浮腫","膝行","壺中","危殆","嚢中",
						"間諜","隠遁","遁巡","這般","甜酒","恢郭","諮諏","淵玄","祁寒","戚容");

YOMI[0][1] = new Array("すいか","ぼうし","いこ","うろん","しれい","ぼうしょく","かんぼく","せいじゅん","ゆうしょう","しゅっき,しゅくき",
					   "ついしゅ,(たいしゅ)","けつがん","そうが","きくもん","ぼしゅん","てきか","ゆうらく","とうぞく","がんろう","じご",
					   "にじゅ","むげ,(むがい)","うゆう","やくし","うけ","かじ","けったい","きゅうだん,(きゅうたん)","かんじ","うと",
					   "えいりん","えんがい","ぎょうが","ふせつ","そうき","びほう,(びぼう)","たいせい","へんぱ","そんい","ぞくげん",
					   "へきえん","かしん","うろ","ゆうはい","せいてつ","しゃくじょう","かっか","かくしゃく","そうけい","ちえ",
					   "きぼく","ほうじん","ゆうぶつ","よくじょう","ゆうもん","きゅうひ","おんり,えんり","けんえん","とそつてん","こうこうや",
					   "ちょざい","そうゆう","こうじ","ろくさい","しょうしゃ","けんしょく","ぞうちょ","しょくじょう","じゅうば","おうせん",
					   "いこう","ちょくん","しし","たいこう","ごうか","とんぼく","ばくしょ","せんりゅう","じょうしょう","こうい",
					   "きゅうせん","じゅし","しずい","やそ","ふうたく","ふしゅ","しっこう","こちゅう","きたい","のうちゅう",
					   "かんちょう","いんとん","しゅんじゅん","しゃはん","てんしゅ","かいかく","ししゅ","えんげん","きかん","せきよう");

KANJI[0][2] = new Array("輯穆","只管","己巳","嘉猷","桑柘","乙亥","允可","牝牡","苧麻","鋒鏑",
					   "芋粥","粥文","坤輿","砧杵","乃公","鳳雛","弼匡","畢生","葺茅","墨煤",
					   "葱青","彼此","釜竈","臼杵","乞骸","禰宜","徽章","禾黍","連亙","輯柔",
					   "大嘗会","椿萱","侃直","釜甑","九皐","卿相","蓑笠","稗史","荏苒","後胤",
					   "濤声","鹿茸","繭紬","尻坐","禾穎","緑埜","寅畏","酋領","彪蔚","隠遁",
					   "瑞穣","貰赦","審訊","聯珠","舛馳","周匝","湛然(「―たる水の底」)","頗僻","董督","牽牛星");

YOMI[0][2] = new Array("しゅうぼく","しかん","きし","かゆう","そうしゃ","いつがい","いんか","ひんぼ","ちょま","ほうてき",
					   "うしゅく","いくぶん","こんよ","ちんしょ","だいこう","ほうすう","ひっきょう","ひっせい","しゅうぼう","ぼくばい",
					   "そうせい","ひし","ふそう","きゅうしょ","きつがい","ねぎ","きしょう","かしょ","れんこう","しゅうじゅう",
					   "だいじょうえ","ちんけん","かんちょく","ふそう","きゅうこう","けいしょう","さりゅう","はいし","じんぜん","こういん",
					   "とうせい","ろくじょう","けんちゅう","こうざ","かえい","りょくや","いんい","しゅうりょう","ひゅううつ,ひょううつ","いんとん",
					   "ずいじょう","せいしゃ","しんじん","れんじゅ","せんち","しゅうそう","たんぜん","はへき","とうとく","けんぎゅうせい");

// 訓読み

QUESTION_STR[1] = '次の漢字の読みを<u>訓読みで(送り仮名も含めて)</u>答えなさい。';

KANJI[1][0] = new Array("苛立つ","亡骸","悉く","粂","縞鯵","凄まじい","煽る(「団扇で―る」)","捗捗しい","薙ぎ倒す","麿",
				  		"捌く","水捌け","蘇る","凋む","鼎","蕩ける","閏年","葛餅","骸(「冷たい―と化す」)","憐れむ",
				  		"萌み","阿る(「上役に―る」)","掬う","噺","這う","雄蕊","匁","燦らか","菰","些か",
				  		"爾(「汝」とも)","袴","捗る","僻む","柾目","瀆す","謬る","靴篦","賂い","撚る",
				  		"靭やか","捻る","曳く","遡る(※２級レベル)","遜る","二俣","蓋う","柵(「世間の―」)","悶える","嵩む",
				  		"蔑む(※２級レベル)","蔑ろ","凌ぐ","兜虫","榊","溢れる","歪む","歪な","相見える","頑に",
				  		"嘗める","嘗て","弄ぶ(※２級レベル)","弄る","伝(「連絡する―がない」)","則る","鎖す","予て","憾む","零れる",
				  		"罷り通る","着熟す","茸狩り","邪(「―な考え」)","糾す","一入(「喜びも―」)","廻らす","託ける","口遊む","啄む",
				  		"族(「行儀を知らぬ―」)","署す","私かに","現(「夢か―か」)","泥む","強か","熱る(「いきる」は1級レベル)","帳","擬物","淋しい",
				  		"嘉する","丹塗り","斜向かい","予め","凝り","項(「―に心惹かれる」)","偏に","閃く","淀む","凱(「―をあげる」)");
					  
YOMI[1][0] = new Array("いらだつ","なきがら","ことごとく","くめ","しまあじ","すさまじい","あおる","はかばかしい","なぎたおす","まろ",
				  		"さばく","みずはけ","よみがえる","しぼむ","かなえ","とろける","うるうどし","くずもち","むくろ","あわれむ",
				  		"めぐみ","おもねる","すくう","はなし","はう","おしべ","もんめ,(め)","あきらか","こも,まこも","いささか",
				  		"なんじ","はかま,(ももひき)","はかどる","ひがむ","まさめ","けがす","あやまる","くつべら","まいない","ひねる,よる",
				  		"しなやか","ねじる,ひねる","ひく","さかのぼる","へりくだる,(ゆずる)","ふたまた","おおう","しがらみ","もだえる","かさむ",
				  		"さげすむ","ないがしろ","しのぐ","かぶとむし","さかき","あふれる,(こぼれる)","ひずむ,ゆがむ,いがむ","いびつな","あいまみえる","かたくなに",
				  		"なめる","かつて","もてあそぶ","いじる,いじくる,(あなどる)","つて","のっとる","とざす,さす","かねて","うらむ","こぼれる",
				  		"まかりとおる","きこなす","たけがり,(きのこがり)","よこしま","ただす","ひとしお","めぐらす","かこつける","くちずさむ","ついばむ",
				  		"やから","しるす","ひそかに","うつつ","なずむ","したたか","ほてる","とばり","まがいもの","さびしい",
				  		"よみする","にぬり","はすむかい","あらかじめ","しこり","うなじ","ひとえに","ひらめく","よどむ","かちどき");

KANJI[1][1] = new Array("掌る","態と","屯する","剰え","適(「―成功した」)","粗(「―満点の出来」)","漁る","和ぐ","辱い","与する",
					    "慮る","妻わす","杢","誼(「昔の―で金を貸す」)","設える","厭う","厭な","厭きる","倦む",
					    "椛","椙","粍","抑(「目的が―違う」)","辿る","疎ら","疏んじる","巽","宥める","宥す",
					    "套ねる","擢んでる","具に","悉に","交(「悲喜―至る」)","錫","厩","栂","肖る(「彼の幸運に―る」)","頗る(「体調は―よろしい」)",
						"蔀","稔る","鴫","咽ぶ","咽む","苛い","澱(「心にたまった―」)","歎える","殆ど","殆うく",
						"戚える","戚む","蓋し(「―その通りであろう」)","沃ぐ","饗す","動もすれば","論う","約める","約やか","認める(「手紙を―」)",
						"夙に","夙い","碍げる","魯か","鳩める","濡う","昌ん","寵む","攪す","莫い","禦ぐ",
						"杜ぐ","畢わる","湊まる","韃つ","顚れる","窄い","矧ぐ","巌しい","傭う","肇める",
						"愈(「―始まる」)","鴛鴦","虎斑","按べる","種籾","瓢","八重葎","牡蠣","姥","笈",
						"掬ぶ","只管","檜扇","痩ける","苫屋","頓に","幌","漣","逗まる","慧い(「利に―い」)");

YOMI[1][1] = new Array("つかさどる","わざと","たむろする","あまつさえ","たまたま","ほぼ","あさる,(すなどる)","なぐ","かたじけない","くみする",
					   "おもんぱかる","めあわす","もく","よしみ","しつらえる","いとう","いやな","あきる","あぐむ,うむ",
					   "もみじ","すぎ","ミリメートル","そもそも","たどる","まばら","うとんじる","たつみ","なだめる","ゆるす",
					   "かさねる","ぬきんでる","つぶさに","つぶさに","こもごも","すず,(たまもの)","うまや","とが,つが","あやかる","すこぶる",
					   "しとみ","みのる","しぎ","むせぶ","のむ","からい,むごい","おり","たたえる","ほとんど","あやうく",
					   "うれえる","いたむ","けだし","そそぐ","もてなす","ややもすれば","あげつらう","つづめる","つづまやか","したためる",
					   "つとに","はやい","さまたげる","おろか","あつめる","うるおう","さかん","めぐむ","みだす","ない","ふせぐ",
					   "ふさぐ","おわる","あつまる","むちうつ","たおれる","せまい","はぐ","けわしい","やとう","はじめる",
					   "いよいよ","おしどり","とらふ","しらべる","たねもみ","ひさご,ふくべ","やえむぐら","かき","うば,(ばば)","おい",
					   "むすぶ","ひたすら","ひおうぎ","こける","とまや","とみに","ほろ","さざなみ","とどまる","さとい");

KANJI[1][2] = new Array("殆(「―困り果てた」)","栖(「―に帰る」)","与し易い","諾う","負む","羅(意味：薄い絹織物)","普く","殉う","嬰れる","稗かい",
					    "尤める","鑓","徒し(「―情けの世を頼み」)","迺ち","醇ら","繫かる","姶い","匡す","訣れる","坐ら(「―にして」)",
						"奄う","聯ねる","允す","胡ぞ","儘く","恢い","尭い","徽い","禎い","佼しい",
						"駕る","詑く","孟め","奄ち","簸る(「糠を―る」)","董す","嘩しい","蒐り","膏える","侃い",
						"捷つ","蒐める","訊う","峻い","蒙る","鍾める","櫛る","而して","劫める","乃ち",
						"曝える","櫓(「火の見―」)","鐙革","廓","忽せ","挺く","塙い","蜎しい","猷る","菅薦",
						"戟","苧殻","灼な","甑","禿(「―髪の童女」)","禿鷹","厨","賤(「―も昔は恋を磨き」)","艮","舷(「―から身を乗り出す」)",
						"寓ける","早蕨","淫る","酋(意味：まとめ治める人)","廟(「―に霊をまつる」)","貰す","瑞瑞しい","諏る","稽る","稽める");

YOMI[1][2] = new Array("ほとほと","すみか","くみしやすい","うべなう","たのむ","うすぎぬ,うすもの","あまねく","したがう","ふれる","こまかい",
					   "とがめる","やり","あだし","すなわち","もっぱら","かかる","みめよい","ただす","わかれる","いながら",
					   "おおう","つらねる","ゆるす","なんぞ","ことごとく","ひろい","たかい","よい","さいわい","うつくしい",
					   "のる","あざむく","はじめ","たちまち","ひる","ただす","かまびすしい","かり","こえる","つよい",
					   "かつ","あつめる","とう","たかい","こうむる","あつめる","くしけずる","しかして","かすめる","すなわち",
					   "さらばえる","やぐら","あぶみがわ","くるわ","ゆるがせ","ぬく","かたい","うつくしい","はかる","すがこも",
					   "ほこ","おがら","あらたかな","こしき","かむろ","はげたか","くりや","しず","うしとら","ふなばた,ふなべり",
					   "かこつける","さわらび","ふける","おさ","みたまや,たまや","ゆるす","みずみずしい","はかる","とどこおる","とどめる");
