/*
KANJI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");

YOMI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");
*/

const CLASS = 3;
const KENTEI_NAME = "三級";
const FILE_NAME = "3class"; // 「○○.html」などで使用
const GENRE = ["植物", "魚介類", "虫", "動物", "物・現象"];
const Q_NUM = [10, 10, 10, 5]; // 大問ごとの問題数
const UNIT_SCORE = [3, 3, 3, 2]; // 大問ごとにおける一問正解の配点
const MAX_SCORE = 100; // 満点
const GOKAKU_SCORE = 80; // 合格点

let QUESTION_STR = new Array(); // 問題文＋配点
let KANJI = new Array(); // 出題漢字
let YOMI = new Array(); // 正解

// 多次元配列の生成
for (let i=0; i<10; i++) {
	QUESTION_STR[i] = new Array();
	KANJI[i] = new Array();
	YOMI[i] = new Array();
}

// Q1

QUESTION_STR[0][0] = '次の植物を表す漢字の読みを答えなさい。';

KANJI[0][0] = new Array("瑪理花","紫繍鞠(「ししゅうきゅう」以外で)","雁翅檜","麻栗樹","九里香(「きゅうりこう」以外で)","烏樟(「うしょう」以外で)","睡菜(「すいさい」以外で)","臭牡丹樹",
				  "映山紅(「えいさんこう」以外で)","無食子","染指草(「そめゆびぐさ」以外で)","赤根草","白楊樹(「はくようじゅ」以外で)","紫薇(「しび」以外で)",
				  "金糸荷","蚊母樹","青茅","蘢","黒参","六月雪",
				  "野天門","豆鼓草","仏虚","灯芯草(「とうしんそう」以外で)","赤檮","鼠李","山小菜",
				  "竜葵","虎掌","蛇眼草","交枝樹","荷包牡丹",
				  "榠櫨","木豇豆","五味子(「ごみし」以外で)","天名精(「てんめいせい」以外で)","珍珠花",
				  "胡孫眼","南燭","燉煌瓜","接続草","一夜草(「ひとよぐさ」以外で)","馬蹄草(「ばていそう」以外で)","白屈菜(「はっくつさい」以外で)","蒟醤",
				  "相思草(「そうしそう」以外で)","蛇菰","瑞香(「ずいこう」以外で)","急就草","馬棘","和蘭三葉(かな３文字で)",
				  "仏甲草(「ぶっこうそう」以外で)","小金瓜(「こがねうり」以外で)","知母","五爪籠","仙毛欅","紫羅傘",
				  "金線草(「きんせんそう」以外で)","菟糸子(「としし」以外で)","紫葳","鶏腸草",
				  "虎茄","女蘿(「じょら」以外で)","及己(「きゅうき」以外で)","放春花",
				  "二十日草(「はつかぐさ」以外で)","元宝草(「げんぽうそう」以外で)","野蜀葵","百脈根(「ひゃくみゃくこん」以外で)","紫金牛(「しきんぎゅう」以外で)",
				  "貎佳草","大茴香(「だいういきょう」以外で)","一葉草(「ひとはぐさ」以外で)","長寿花",
				  "胡蘿蔔","錦被花(「きんぴか」以外で)","茶梅(「ちゃばい」以外で)","二度芋","崖石榴",
				  "連枝草","水豆児","省沽油","四照花(「ししょうか」以外で)",
				  "十大功労","爵牀","仙人帽","紫荊","羅漢松",
				  "土当帰","何首烏(「かしゅう」以外で)","怕痒華:怕癢華","錦帯花","黄花龍芽",
				  "蜘蛛抱蛋","石松","烏臼","磚子苗","側金盞花",
				  "山石榴(「さんせきりゅう」以外で)","黄精","瓶爾小草","鴨舌草","天仙果",
				  "蕎麦葉貝母","王不留行","海州常山","鉄掃帚","秋葵","夕化粧");

YOMI[0][0] = new Array("あじさい","あじさい","あすなろ","チーク,(チイク)","きんもくせい","くろもじ","みつがしわ","くさぎ",
				  "つつじ","どんぐり","ほうせんか","ほうれんそう","はこやのき,ポプラ","さるすべり",
				  "ゆきのした","いすのき","かりやす","いぬたで","ごまのはぐさ","はくちょうげ",
				  "アスパラガス","あやめ","いかりそう","いぐさ","いちい","くろうめもどき","ほたるぶくろ",
				  "うみほおずき,いぬほおずき","うらしまそう","いわがねそう","ねむのき","けまんそう,けまんぼたん",
				  "かりん,メイサ","きささげ","さねかずら","やぶたばこ,(いのしりぐさ)","ゆきのした,こごめばな",
				  "さるのこしかけ","しゃしゃんぼ","すいか","すぎな","すみれ","かきどおし","くさのおう","きんま",
				  "たばこ","つちとりもち","じんちょうげ","つわぶき","こまつなぎ","セロリ",
				  "つめれんげ","トマト","はなすげ","やぶがらし","いぬぶな","いちはつ",
				  "みずひき,みずひきそう","ねなしかずら","のうぜんかずら","はこべ",
				  "はしりどころ","さるおがせ,ひかげのかずら","ふたりしずか,(つきねぐさ)","ぼけ",
				  "ぼたん","ほとけのざ","みつば,みつばぜり","みやこぐさ","やぶこうじ",
				  "かきつばた,かおよぐさ,しゃくやく","アニス","すみれ","きずいせん",
				  "にんじん","ひなげし","さざんか","じゃがいも","いたびかずら",
				  "うまごやし","たぬきも","みつばうつぎ","やまぼうし",
				  "ひいらぎなんてん","きつねのまご","きぬがさたけ","はなずおう,すおうき","いぬまき",
				  "うど,のだけ","つるどくだみ","さるすべり","はこねうつぎ","おみなえし",
				  "はらん","ひかげのかずら","なんきんはぜ","いぬくぐ,くぐ","ふくじゅそう",
				  "のぼたん","なるこゆり","はなやすり","こなぎ","いちじく",
				  "うばゆり","どうかんそう","くさぎ","めどはぎ","オクラ","おしろいばな");

QUESTION_STR[0][1] = '次の魚介類を表す漢字の読みを答えなさい。';

KANJI[0][1] = new Array("青蝦","青竜蝦","蚌","老海鼠","石礬魚","丸魚","年俊魚","墨西哥鯢",
				  "梭尾螺","鯯","鯷","記月魚","串貝","蛇頭魚","六角魚","海鰻鱺","鋸刺鮭",
				  "鯧","銀口魚","琵琶魚","華臍魚","鱏","文鰩魚","金線魚",
				  "王余魚","鼠頭魚","石桂魚","馬鮫魚","鬼頭魚","泉海魚","鮎(かな３文字で)","九万疋",
				  "犁頭魚","松江魚","魚虎","金鎗魚","丁斑魚","斑節蝦",
				  "霊蠃子","硴","十脚","海燕","魵","魪","杖突蝦","鱵",
				  "鮐","烏頬魚","魚夏","魷","鱐","紫鰓魚","金鱗魚","八角金盤","黄錮魚",
				  "黒漫魚");

YOMI[0][1] = new Array("しばえび","しゃこ","はまぐり","ほや","うぐい","すっぽん","はぜ","ウーパールーパー",
				  "ほらがい","このしろ,さっぱ","ひしこ","あゆ","あわび","ぼら","かながしら","あなご","ピラニア",
				  "まながつお","あゆ","あんこう","あんこう","えい,(ちょうざめ),(かじき)","とびうお","いとよりだい,いとより",
				  "かれい","きす","さけ,しゃけ","さわら","しいら","うなぎ,まんぼう,うきぎ","なまず","くまびき",
				  "しゅもくざめ","すずき","はりせんぼん,かわせみ,さかまた","まぐろ","めだか","くるまえび",
				  "うに,れいらし","かき","さくらえび","たこのまくら","えび","かれい","てながえび","さより",
				  "ふぐ","くろだい","わかし","いか","しゃちほこ","すずき","にべ","やつで","わたか",
				  "まぐろ");

QUESTION_STR[0][2] = '次の虫を表す漢字の読みを答えなさい。';

KANJI[0][2] = new Array("螇蚸","白灯蛾","蚜虫","蚱蝉",
				  "笄蛭","長吻虻","天蛾","半風子","腰細蜂","虺","独角仙",
				  "鼠姑","螽(かな６文字で)","木虱","扁螺","蠅虎","螕","蠊(かな５文字で)",
				  "蠹","黽","蠖","燭夜","襀翅(「せきし」以外で)","蛔",
				  "鼓豆虫","蟇子","蚰衍","蛺蝶","赤卒(「せきそつ」以外で)","螾",
				  "蛼","蜾蠃","蝸螺","蝘蜓","蝤蠐","蛞",
				  "螇鹿","蟫","蠋","虵医","蛩","蜀",
				  "蝸(かな２文字で)","蝎(かな５文字で)","蝘:螗","螟","鳴蜩");

YOMI[0][2] = new Array("ばった,はたはた","しろひとり","あぶらむし,ありまき","くまぜみ,なわせみ",
				  "こうがいびる","つりあぶ","すずめが","しらみ","じがばち","まむし","かぶとむし",
				  "わらじむし","はたおりむし","だに","きさご","はえとりぐも","だに","あぶらむし",
				  "きくいむし,しみ","あおがえる","しゃくとりむし","ほたる","かわげら","はらのむし,かいちゅう",
				  "みずすまし","ぶゆ,ぶよ","げじげじ","たてはちょう","あかとんぼ,(あかえんば)","みみず",
				  "こおろぎ","すがる,じがばち","にな","とかげ","すくもむし","おたまじゃくし",
				  "にいにいぜみ","しみ","あおむし","いもり","こおろぎ","いもむし,あおむし,とうまる",
				  "にな,にし","きくいむし,すくもむし","なつぜみ","ずいむし","あぶらぜみ");

QUESTION_STR[0][3] = '次の動物を表す漢字の読みを答えなさい。';

KANJI[0][3] = new Array("恠鳥","獦子鳥","魹","黄頷蛇","鸊鷉",
				  "奴延鳥","鵄","企鵝","鳥馬","嫁学鳥:雪姑",
				  "按状翼:仙鼠","鸞豬","白露鶏:吐綬鶏(「とじゅけい」以外で)","巧婦鳥","金翅雀",
				  "喚起鳥","水史鳥","鵟","鴟鵂","祝鳩");

YOMI[0][3] = new Array("ぬえ","あとり","とど","あおだいしょう","かいつぶり",
				  "ぬえ","とび","ペンギン","つぐみ","せきれい",
				  "こうもり","やまあらし","しちめんちょう","みそさざい","ひわ",
				  "うぐいす","ちどり","のすり","みみずく,(このはずく)","もず");
				  
QUESTION_STR[0][4] = '次の物・現象を表す漢字の読みを答えなさい。';

KANJI[0][4] = new Array("頑癬","白禿瘡","馬尾毛","尸童","針眼","投子",
				  "海蠃独楽","埴破","釿","樏","霈(かな４文字で)",
				  "弓弭","襪(かな４文字で)","白絖","瓮","淦","圷","雩(かな４文字で)",
				  "罍(かな４文字で)","手繦","粘土(「へ」から始めて)","白雨(「しらさめ」以外で)",
				  "踏鞴:蹈鞴","霎(かな３文字で)","霓","靫");

YOMI[0][4] = new Array("たむし","しらくも","ばす","よりまし","みず","さいころ",
				  "べいごま,ばいごま","はんなり","ちょうな","かんじき","おおあめ",
				  "ゆはず","くつした","しろぬめ","もたい,へ","あか","あくつ","あまひき",
				  "さかだる","たすき","へなつち,へな","ゆうだち",
				  "たたら","こさめ","にじ","うつぼ,ゆぎ");

// Q2

QUESTION_STR[1][0] = '次の漢字の読みを<u>訓読みで(送り仮名も含めて)</u>答えなさい。';

KANJI[1][0] = new Array("咫い","曩に","尸る","疎忽しい","厶る","齷く","遯れる",
				  "罕に","羸れる","麤しい","黽める",
				  "肆","贅な","孳尾む","兀い","鹵う","鬮る","蹈する",
				  "孼い","鬩う","捫す","膝行る","躋る",
				  "蘞い","扈る","遑しい","闃か","軫む","凸む",
				  "丕きい","售る","醺い","轂る",
				  "翹てる","熙ぶ","魏い","閼る","病き",
				  "齬う","皁い","黜ける","乂る","貪り","踟る",
				  "嬖がる","羸弱い","闖う","襭む",
				  "潴り","燼り","訌め","霾り",
				  "訥","謖がる","謦い","蟄もる","徊う","渇る","間う",
				  "次る","字む","首す","周く","職る","絶る","輸る",
				  "兆い","低れる","獄える","田る","賓う","付える","毎る",
				  "噦く","楽む","索る","丨く","丨む",
				  "徘徊る","権る","款待す","蛻る","犇る","纈め","貪眠い","嗇か",
				  "建す","毋い","氛い","匱しい","佻しい","憮する","惘する",
				  "焦慮る","浮雲い","弄う","介意う");

YOMI[1][0] = new Array("ちかい,みじかい","さきに","つかさどる","そそっかしい","ござる","こせつく","のがれる,かくれる",
				  "まれに","つかれる","あらあらしい","つとめる",
				  "ほしいまま","よけいな","つるむ","たかい","うばう","たたかいとる","あしぶみする",
				  "わざわい","いいあらそう","ひねりつぶす","いざる","のぼる",
				  "えぐい","はびこる","あわただしい","しずか","いたむ","つばくむ",
				  "おおきい","うる","ほろよい","しめくくる",
				  "つまだてる","よろこぶ","たかい","さえぎる","いたつき,いたずき,いたづき",
				  "くいちがう","くろい","しりぞける","かる","よくばり","たちもとおる",
				  "かわいがる","かよわい","うかがう","つまばさむ",
				  "みずたまり","もえのこり","うちわもめ","つちぐもり",
				  "くちべた","おきあがる","せきばらい","とじこもる","さまよう","むさぼる","うかがう",
				  "やどる","はぐくむ","もうす","あまねく","つかさどる","わたる","おくる",
				  "うらない","たれる","うったえる","かる","したがう","あたえる","むさぼる",
				  "えずく","このむ","あなぐる","しりぞく","すすむ",
				  "たもとおる","はかる","もてなす","もぬける","はしる","しぼりぞめ","いぎたない","やぶさか",
				  "くつがえす","ない","わざわい","とぼしい","かるがるしい","がっかりする","ぼんやりする",
				  "じれる","あぶない","いらう","かまう");

QUESTION_STR[1][1] = '次の漢字一文字の読みを<u>訓読みで</u>答えなさい。';

KANJI[1][1] = new Array("殯","纛","鬯","蹐","野(かな４文字で)",
						"絮","亟","壎","丐","蝟","蹠",
						"犢","冤","鹹","魃","驟","輾",
						"風(かな４文字で)","倪","囹","糵","誕",
						"庠","彙","霎","齦","糴",
						"枉","冤","嶝","弋","寝(かな４文字で)",
						"顴","驪","髏","觴","衂",
						"相(かな４文字で)","更(かな４文字で)","腕(かな４文字で)",
						"齲","纜","気(かな２文字で)","韲",
						"顔(かな４文字で)","鑷","閘");
				  
YOMI[1][1] = new Array("かりもがり","はたぼこ,(おにがしら)","においざけ","ぬきあし,さしあし","いなかや",
						"わたいれ,わた","しばしば","つちぶえ","こじき","はりねずみ","あしのうら",
						"こうし","ぬれぎぬ,あだ","しおけ","ひでり","しばしば","ひきうす",
						"ならわし","ながしめ,きわ","ひとや","もやし,こうじ","ほしいまま",
						"まなびや","はりねずみ","こさめ","はぐき","かいよね,いりよね",
						"むじつのつみ","ぬれぎぬ","さか,さかみち","いぐるみ","みたまや",
						"ほおぼね","くろうま","されこうべ,しゃれこうべ","さかずき","はなぢ",
						"こもごも","こもごも","ただむき",
						"むしば","ともづな","いき","なます,あえもの",
						"かんばせ","けぬき","ひのくち");

// Q3

QUESTION_STR[2][0] = '次の熟語の読みを<u>音読みで</u>答えなさい。';

KANJI[2][0] = new Array("丫髻","丕図","麕至","冉々","崎嶇","瓊葩","孱羸","撃柝","搏闘",
				  "售賈","嫩葉","已己巳己","秉彝","玉蟾","丱角","焼燬","泯滅",
				  "賑恤","愆尤","懋勲","煎熬","黔黎","饕餮","藐視","闃寂",
				  "貧窶","糴糶","大纛","羸瘦","瑇玻盞","斫断","遯竄","駐箚",
				  "耄耋","朶頤","癰疽","紫檀","蝉蛻","簷頭","噴嚔","黽勉","蛙黽",
				  "忠謇","赧然","困屯","淡靄","吮疽","躋攀","作輟","筱驂",
				  "朝暾","蜑戸","鐫録","笞擽","猋々","棺椁","筮卜",
				  "厭飫","鹵莽","黜陟","耿然","濁醪","蕩滌","敗衄","匳冊",
				  "壎篪","熙笑","鼕々","齲歯","孑孒","恬澹",
				  "佞猾","翕然","嶷然","逗撓","蚩々","喞々","彬々","孳々",
				  "鏗錚","亟肄","牙籌","肉髻","遐陬","皺襞","賚賜","軍荼利",
				  "涸竭","狐狗貍","靦愧","覓索","壼奥","耒耜","彗孛","肆廛","粥獄",
				  "游愒","愒時","噫欠","隈澳","罅漏","倅車","佚宕","培塿",
				  "俶儻","説懌","串狎","鬩牆","大圜","蝸螺","喑噁","参縒",
				  "欹歟","繳弋","弋矰","繳繞","尋找","木屐","饕餮文",
				  "賁星","賁然","頡頏","泛駕","咆烋","趨数","嘔呴","瞞然",
				  "偈頌","従頌","焼畬","奎踽","裊々","閼伽",
				  "汨水","枳首蛇","帀旬","霊蠃子","東鱟","硨螯",
				  "淼淼","登瀛州","彳亍","砉然","繋驢橛");

YOMI[2][0] = new Array("あけい","ひと","くんし","ぜんぜん","きく","けいは","せんるい","げきたく","はくとう",
				  "しゅうこ","どんよう","いこみき","へいい","ぎょくせん","かんかく","しょうき","びんめつ",
				  "しんじゅつ","けんゆう","ぼうくん","せんごう","けんれい","とうてつ","びょうし","げきせき",
				  "ひんく","てきちょう","だいとう","るいそう","たいひさん","しゃくだん","とんざん","ちゅうさつ",
				  "ぼうてつ","だい","ようそ","したん","せんぜい","えんとう","ふんてい","びんべん","あぼう",
				  "ちゅうけん","たんぜん","こんちゅん","たんあい","せんそ","せいはん","さくてつ","しょうさん",
				  "ちょうとん","たんこ","せんろく","ちりゃく","ひょうひょう","かんかく","ぜいぼく",
				  "えんよ","ろもう","ちゅっちょく","こうぜん","だくろう","とうでき","はいじく","れんさつ",
				  "けんち","きしょう","とうとう","うし,くし","けっきょう,けつきょう,げっきょう","てんたん",
				  "ねいかつ","きゅうぜん","ぎょくぜん","とうどう","しし","しょくしょく","ひんぴん","しし",
				  "こうそう","きい","がちゅう","にっけい,にくけい","かすう","しゅうへき","らいし","ぐんだり",
				  "こけつ","こっくり","てんき","べきさく","こんおう","らいし","すいはい","してん","いくごく",
				  "ゆうけい","かいじ","あいけん","わいいく","かろう","さいしゃ","てっとう","ほうろう",
				  "てきとう","えつえき","かんこう","げきしょう","たいえん","らら","いんお","しんし",
				  "いよ","しゃくよく","よくそう","きょうじょう","じんそう","もくげき","とうてつもん",
				  "ほんせい","ひぜん","けっこう","ほうが","ほうこう","そくそく","くく","もんぜん",
				  "げじゅ","しょうよう","しょうしゃ","きく,けいく","じょうじょう","あか",
				  "べきすい","ししゅだ","そうじゅん","れいらし","とうごう","しゃごう",
				  "びょうびょう","とうえいしゅう","てきちょく","けきぜん","けろけつ");

// Q4

QUESTION_STR[3][0] = '次の都市名を表す漢字の読みを<u>カタカナで</u>答えなさい。';

KANJI[3][0] = new Array("雅典","亜馬生","亜武的達","阿羅斯加","阿爾卑斯",
				  "亜歴山特","英蘭","維納","牛津","鄂霍次克",
				  "改羅","加里保爾尼","甲谷佗","瓜姆","格林威治",
				  "角布","剣橋","高加索","戈壁","古倫母",
				  "撒哈拉","聖市","桑港","舎路",
				  "悉徳尼","爪哇","寿府","蘇素","蘇格蘭",
				  "士篤恒","聖路易","得撒","多倫多","新英土",
				  "紐瀬流","紐育","報達","聖林","布哇",
				  "晩克坡","漢堡","喜馬拉雅","費府","倍諾愛勒",
				  "佛羅里達","伯林","澳門","馬徳里","馬耳塞",
				  "曼澈斯特","米西西皮","閔行","莫斯科","欧羅巴",
				  "羅馬","羅府","路照","倫敦","華盛頓");

YOMI[3][0] = new Array("アテネ","アマゾン","アムステルダム","アラスカ","アルプス",
				  "アレクサンドリア","イングランド","ウィーン,ウイーン","オックスフォード","オホーツク",
				  "カイロ","カリフォルニア","カルカッタ","グアム","グリニッジ",
				  "ケープタウン","ケンブリッジ","コーカサス","ゴビ","コロンボ",
				  "サハラ","サンパウロ","サンフランシスコ","シアトル",
				  "シドニー","ジャワ","ジュネーブ","スエズ","スコットランド",
				  "ストックホルム","セントルイス","テキサス","トロント","ニューイングランド",
				  "ニュージャージー","ニューヨーク","バグダッド","ハリウッド","ハワイ",
				  "バンクーバー","ハンブルク","ヒマラヤ","フィラデルフィア","ブエノスアイレス",
				  "フロリダ","ベルリン","マカオ","マドリード","マルセイユ",
				  "マンチェスター","ミシシッピ","ミュンヘン","モスクワ","ヨーロッパ",
				  "ローマ","ロサンゼルス","ロッテルダム","ロンドン","ワシントン");