/*
KANJI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");

YOMI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");
*/

let KANJI = new Array();
let YOMI = new Array();

let TITLE = "漢字しりとり(仮) - レベル３";
let PAGE_TITLE = "漢字しりとり(仮) レベル３";
let BACKGROUND_URL = "../img/img_home.jpg";

let LEVEL = 3;
let NAME = "NO_NAME";
let NAME_EN = "tama";
let IMAGE_URL = "";
let GENRE = "植物・鳥・虫";

// 「あ」～「お」

KANJI[0] = new Array("見風乾","柳葉菜","明衣","榔楡","土常山","絞股藍",
					"紫繍鞠","雁翅檜","山慈姑","紫菜","大葉藻","退紅","土荊芥",
					"野天門","豆鼓草","蘆薈","臙脂菜");

YOMI[0] = new Array("あかしで","あかばな","あかは,あかはとり","あきにれ","あまちゃ","あまちゃづる",
					"あじさい","あすなろ","あまな","あまのり","あまも","あらぞめ","ありたそう",
					"アスパラガス","あやめ","アロエ","あかざ");

KANJI[1] = new Array("木蓮子","赤檮","大角草","茅膏菜","鹿蹄草","磚子苗","仙毛欅","羅漢松",
					 "蘢","蚊母樹","仏虚","蛇眼草","常春藤","石竜牙草","千秋",
					 "東海美人","石胡萎","蹲鴟","婆婆納","淫羊藿");

YOMI[1] = new Array("いたび","いちい","いささぐさ","いしもちそう","いちやくそう","いぬくぐ","いぬぶな","いぬまき",
					"いぬたで","いすのき","いぐさ","いわがねそう","いつまでぐさ","いしもちそう","いわひば",
					"いがい","ちどめぐさ","いもがしら","いぬのふぐり","いかりそう");

KANJI[2] = new Array("虎掌","績麻","楊櫨木","猪籠草","連枝草",
					"白梨樹","竜葵","毛茛");

YOMI[2] = new Array("うらしまそう","うみお,うみそ","うつぎ","うつぼかずら","うまごやし",
					"うらじろのき","うみほおずき","うまのあしがた");

KANJI[3] = new Array();

YOMI[3] = new Array();

KANJI[4] = new Array("珍珠菜","金沸草","江籬","紫茉莉","小連翹",
					"野芝麻","牛筋草","紅樹","黄花龍芽","滴滴金",
					"蝌蚪");

YOMI[4] = new Array("おかとらのお","おぐるま","おごのり","おしろいばな","おとぎりそう",
					"おどりこそう","おひしば","おひるぎ","おみなえし","おぐるま",
					"おたまじゃくし");

// 「か」～「こ」

KANJI[5] = new Array("百両金","杜夫魚","金襖子","黄鶏","石陰子","鳩酸草",
					 "貎佳草","車前葉","加拿林雀","襀翅");

YOMI[5] = new Array("からたちばな","かくぶつ","かじかがえる","かしわ","かせ","かたばみ",
					"かきつばた,かおよぐさ","かたくり","カナリア","かわせみ");

KANJI[6] = new Array("九里香","金瘡小草","爵牀","仙人帽","紅南瓜",
					 "泥胡菜","蠹");

YOMI[6] = new Array("きんもくせい","きらんそう","きつねのまご","きぬがさたけ","きんとうが",
					"きつねあざみ","きくいむし");

KANJI[7] = new Array("海州常山","鼠李","威霊仙","白屈菜","黄連花",
					"鼠李","山白竹","馬鞭草","山藤");

YOMI[7] = new Array("くさぎ","くろうめもどき","くがいそう","くさのおう","くされだま",
					"くろうめもどき","くまざさ","くまつづら","くまやなぎ");

KANJI[8] = new Array("荷包牡丹","毳い","毯","槁","毛足鵟","電纜");

YOMI[8] = new Array("けまんそう,けまんぼたん","けばい","けむしろ","けやき","けあしのすり","ケーブル");

KANJI[9] = new Array("麻葉繡毬","金漆","金松","火踏子",
					 "蛼");

YOMI[9] = new Array("こでまり","こしあぶら","こうやまき","こたつ",
					"こおろぎ");

// 「さ」～「そ」

KANJI[10] = new Array("槐葉蘋","南五味子","狗舌草","三毬杖","松蘿",
					  "怕痒樹","胡孫眼","山梗葉","寿光木","弱檜");

YOMI[10] = new Array("さんしょうも","さねかずら","さわおぐるま","さぎちょう","さるおがせ",
					 "さるすべり","さるのこしかけ","さわぎきょう","さわぐるみ","さわら");

KANJI[11] = new Array("鴉葱","東風菜","君遷子","笑靨花",
					  "吐綬鶏","天社蛾","挙尾虫","半風子","蠖");

YOMI[11] = new Array("しらいとそう","しらやまぎく","しなのがき","しじみばな",
					  "しちめんちょう","しゃちほこが","しりあげむし","しらみ","しゃくとりむし");

KANJI[12] = new Array("問荊","燉煌瓜","一夜草");

YOMI[12] = new Array("すぎな","すいか","すみれ");

KANJI[13] = new Array("石蜐","鬼鍼草","剪秋羅","嫁学鳥");

YOMI[13] = new Array("せ","せんだんぐさ","せんのう","せきれい");

KANJI[14] = new Array("雀卵斑","鳳尾松","鉄蕉");

YOMI[14] = new Array("そばかす","そてつ","そてつ");

// 「た」～「と」

KANJI[15] = new Array("洋玉蘭","栄蘭","水豆児","淡把菰","相思草");

YOMI[15] = new Array("たいさんぼく","たこのき","たぬきも","たばこ","たばこ");

KANJI[16] = new Array("玉環菜","狼尾草","水甘草","天青地白");

YOMI[16] = new Array("ちょろぎ","ちからしば","ちょうじそう","ちどめぐさ");

KANJI[17] = new Array("落葵","黄麻","江浦草","山珊瑚","蛇菰","地胆",
					  "映山紅","光桃","鴾毛","鷸子","何首烏","鳥馬");

YOMI[17] = new Array("つるむらさき","つなそ","つくも","つちあけび","つちとりもち","つちはんみょう",
					 "つつじ","つばいもも","つきげ","つぶり","つるどくだみ","つぐみ");

KANJI[18] = new Array("桃金嬢","草蝦","石花菜");

YOMI[18] = new Array("てんにんか","てながえび","てんぐさ");

KANJI[19] = new Array("水鼈","沢漆","三角楓","金線蛙","野老",
					  "一日花","蝘蜓");

YOMI[19] = new Array("とちかがみ","とうだいぐさ","とうかえで","とのさまがえる","ところ",
					 "とろろあおい","とかげ");

// 「な」～「の」

KANJI[20] = new Array("烏臼","野菰","蜀椒","続断","黄精",
					  "土肉","螗");

YOMI[20] = new Array("なんきんはぜ","なんばんぎせる","なるはじかみ","なべな","なるこゆり",
					  "なまこ","なつぜみ");

KANJI[21] = new Array("郁李","蟪蛄","蝸");

YOMI[21] = new Array("にわうめ","にいにいぜみ","にな,にし");

KANJI[22] = new Array();

YOMI[22] = new Array();

KANJI[23] = new Array("菟糸","女貞","交枝樹");

YOMI[23] = new Array("ねなしかずら","ねずみもち","ねむのき");

KANJI[24] = new Array("土当帰","和尚菜");

YOMI[24] = new Array("のだけ","のぶき");

// 「は」～「ほ」

KANJI[25] = new Array("紫参","刺楸","蛇牀","爆米","瓶爾小草",
					  "玉鈴花","六月雪","虎茄","黄櫨",
				      "知母","牛縻","鼠麴草","蔓荊","黄槿","文珠蘭","馬銜","金花虫","三白草",
					  "青頭菌","紫荊","石長生");

YOMI[25] = new Array("はるとらのお","はりぎり","はまぜり","はぜ","はなやすり",
					  "はくうんぼく","はくちょうげ","はしりどころ","はぜ,はぜのき,はじ",
				      "はなすげ","はなづら","ははこぐさ","はまごう","はまぼう","はまゆう","はみ","はむし","はんげしょう",
					  "はつたけ","はなずおう","はこねそう");

KANJI[26] = new Array("石松","小舌","漏蘆","赤栴檀","白英","山蘭",
					  "睡蓮","石韋","山丹","鼓子花","眼子菜");

YOMI[26] = new Array("ひかげのかずら","ひこ","ひごたい","ひめしゃら","ひよどりじょうご","ひよどりばな",
					 "ひつじぐさ","ひとつば","ひめゆり","ひるがお","ひるむしろ");

KANJI[27] = new Array("側金盞花","白花菜","蘭草","恭菜");

YOMI[27] = new Array("ふくじゅそう","ふうちょうそう","ふじばかま","ふだんそう");

KANJI[28] = new Array("巻子","牛皮凍");

YOMI[28] = new Array("へそ","へくそかずら");

KANJI[29] = new Array("山小菜","人面竹","塊芋","赤根草","馬勃",
					  "燭夜");

YOMI[29] = new Array("ほたるぶくろ","ほていちく","ほど","ほうせんか","ほこりたけ",
					 "ほたる");

// 「ま」～「も」

KANJI[30] = new Array("射翳","山蘿蔔","斑杖","菴羅","虺");

YOMI[30] = new Array("まぶし","まつむしそう","まむしぐさ","マンゴー","まむし");

KANJI[31] = new Array("灯台木","浮薔","金線草","野蜀葵","省沽油","黄瑞香",
					  "睡菜","金線草","六月菊");

YOMI[31] = new Array("みずき","みずあおい","みずひき","みつば,みつばぜり","みつばうつぎ","みつまた",
					 "みつがしわ","みずひき,みずひきそう","みやまよめな");

KANJI[32] = new Array("野木瓜");

YOMI[32] = new Array("むべ");

KANJI[33] = new Array("益母草","鉄掃箒","榠櫨");

YOMI[33] = new Array("めはじき","めどはぎ","メイサ");

KANJI[34] = new Array("唐木香","厚皮香","妄榧","天竺鼠","栴",
					  "鴃");

YOMI[34] = new Array("もっこう","もっこく","もみ","モルモット","もみじ",
					 "もず");

// 「や」～「よ」

KANJI[35] = new Array("窃衣","金剛纂","貫衆","四照花","九面芋","鶏眼草","天名精",
					  "胡蝶樹","商陸","野山薬");

YOMI[35] = new Array("やぶじらみ","やつで","やぶそてつ","やまぼうし","やつがしら","やはずそう","やぶたばこ",
					 "やぶでまり","やまごぼう","やまのいも");

KANJI[36] = new Array("珍珠花","鹿薬");

YOMI[36] = new Array("ゆきやなぎ","ゆきざさ");

KANJI[37] = new Array("蒿","娵菜");

YOMI[37] = new Array("よもぎ","よめな");

// 「ら」～「ろ」

KANJI[38] = new Array("紫丁香花","御僊花");

YOMI[38] = new Array("ライラック","ライチ");

KANJI[39] = new Array("紫丁香花","蘋婆");

YOMI[39] = new Array("リラ","りんご");

KANJI[40] = new Array("拡大鏡","櫑茶","瑠璃鶲","輪盤賭","坩堝");

YOMI[40] = new Array("ルーペ","るいざ","るりびたき","ルーレット","るつぼ");

KANJI[41] = new Array("紫雲英","藜藋");

YOMI[41] = new Array("れんげそう","れいち");

KANJI[42] = new Array("臘梅","僂佝","羅馬菊","鹿苑草","菉豆",
					  "轆轤鉋");

YOMI[42] = new Array("ろうばい","ろうく","ロオマギク","ろくおんそう","ろくどう",
					 "ろくろがんな");

// 「わ」

KANJI[43] = new Array("仙蓼","鼠姑");

YOMI[43] = new Array("われもこう","わらじむし");



// 「が」～「ご」

KANJI[44] = new Array("腸線","金銀蓮花");

YOMI[44] = new Array("ガット","ががぶた");

KANJI[45] = new Array("紫萼","黄顙魚","刻魚","義須","銀馬");

YOMI[45] = new Array("ぎぼうし","ぎぎ","ぎざみ","ぎす","ぎま");

KANJI[46] = new Array();

YOMI[46] = new Array();

KANJI[47] = new Array("紫雲英","砕米菜","蚰衍","下足","挙固","元禄鯛");

YOMI[47] = new Array("げんげ","げんげ","げじげじ","げそ,げそく","げんこ","げんろくだい");

KANJI[48] = new Array("野鴉椿","玄参","埖","檱","鶄");

YOMI[48] = new Array("ごんずい","ごまのはぐさ","ごみ","ごいし,ご","ごいさぎ");

// 「ざ」～「ぞ」

KANJI[49] = new Array("粟米草","楉","篅");

YOMI[49] = new Array("ざくろそう","ざくろ","ざる");

KANJI[50] = new Array("沿階草","瑞香","二度芋","腰細蜂");

YOMI[50] = new Array("じゃのひげ","じんちょうげ","じゃがいも","じがばち");

KANJI[51] = new Array("棠梨","楉蟹","螟");

YOMI[51] = new Array("ずみ","ずわいがに","ずいむし");

KANJI[52] = new Array("紫萁","荍","鏹");

YOMI[52] = new Array("ぜんまい","ぜにあおい","ぜに");

KANJI[53] = new Array();

YOMI[53] = new Array();

// 「だ」～「ど」

KANJI[54] = new Array("回青橙","八脚子","天竺牡丹");

YOMI[54] = new Array("だいだい","だに","ダリア");

KANJI[55] = new Array();

YOMI[55] = new Array();

KANJI[56] = new Array();

YOMI[56] = new Array();

KANJI[57] = new Array("胡","蝓","疕","塑");

YOMI[57] = new Array("でたらめ","でんでんむし","できもの","でく");

KANJI[58] = new Array("無食子","王不留行");

YOMI[58] = new Array("どんぐり","どうかんそう");

// 「ば」～「ぼ」

KANJI[59] = new Array("馬尾毛","螇蚸","鬽","飧");

YOMI[59] = new Array("ばす","ばった","ばけもの","ばんめし");

KANJI[60] = new Array("編木","金糸桃","壜麦酒");

YOMI[60] = new Array("びんざさら","びようやなぎ","ビンビール");

KANJI[61] = new Array();

YOMI[61] = new Array();

KANJI[62] = new Array("景天");

YOMI[62] = new Array("べんけいそう");

KANJI[63] = new Array("放春花");

YOMI[63] = new Array("ぼけ");

// 「ぱ」～「ぽ」

KANJI[64] = new Array("紅辣椒");

YOMI[64] = new Array("パプリカ");

KANJI[65] = new Array();

YOMI[65] = new Array();

KANJI[66] = new Array();

YOMI[66] = new Array();

KANJI[67] = new Array("北亰烤鴨","薄荷酒");

YOMI[67] = new Array("ペキンダック","ペパーミント");

KANJI[68] = new Array("白楊樹");

YOMI[68] = new Array("ポプラ");
