/*
KANJI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");

YOMI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");
*/

let KANJI = new Array();
let YOMI = new Array();

let TITLE = "漢字しりとり(仮) - レベル１";
let PAGE_TITLE = "漢字しりとり(仮) レベル１";
let BACKGROUND_URL = "../img/img_home.jpg";

let LEVEL = 1;
let NAME = "ポチ";
let NAME_EN = "wan";
let IMAGE_URL = "t.co/aCdMJx0yTh";
let GENRE = "食べ物・植物・小さいもの";

// 「あ」～「お」

KANJI[0] = new Array("間鴨","氷菓子","扁桃","蟻","粟",
				  "葵","青桐","紫陽花","皸","藜","畦道",
				  "茜","灰汁","欠伸","胡坐","鳳蝶",
				  "通草","糸葱","薊","肋骨",
				  "翌檜","土瀝青","馬酔木",
				  "家鴨","肋骨","信天翁","水馬",
				  "酒精","霰","雨虎");

YOMI[0] = new Array("あいがも","アイスクリーム","アーモンド","あり","あわ",
				  "あおい","あおぎり","あじさい","あかぎれ,あかがり","あかざ","あぜみち",
				  "あかね","あく","あくび","あぐら","あげはちょう,あげは",
				  "あけび","あさつき","あざみ","あばらぼね",
				  "あすなろ","アスファルト","あせび,あしび",
				  "あひる","あばらぼね","あほうどり","あめんぼ",
				  "アルコール","あられ","あめふらし");

KANJI[1] = new Array("烏賊","石塊","斑鳩","交喙","磯巾着",
				  "鼬","無花果","公孫樹","犬榧",
				  "犬蓼","鼾","豆娘",
				  "煎海鼠","巻柏","音呼");

YOMI[1] = new Array("いか","いしころ","いかる,いかるが","いすか","いそぎんちゃく",
				  "いたち","いちじく,いちじゅく","いちょう","いぬがや",
				  "いぬたで","いびき","いととんぼ",
				  "いりこ","いわひば","いんこ");

KANJI[2] = new Array("茴香","火酒","嗽","鶯",
				  "鶉","鷽","烏骨鶏","転寝","兎",
				  "優曇華","項","海栗","鰻",
				  "浮塵子","独活");

YOMI[2] = new Array("ういきょう","ウォッカ,ウイスキー","うがい","うぐいす",
				  "うずら","うそ","うこっけい","うたたね","うさぎ,う",
				  "うどんげ","うなじ","うに","うなぎ",
				  "うんか","うど");

KANJI[3] = new Array("笑窪","金雀枝","榎","狗尾草","海老","荏胡麻","豌豆");

YOMI[3] = new Array("えくぼ","エニシダ","えのき","えのころぐさ","えび","えごま","えんどう");

KANJI[4] = new Array("鸚鵡","麋","雪花菜","万年青",
				  "鳳","車前草","極光","朮",
				  "歩行虫","鴛鴦","荻",
				  "巻耳","馬大頭","阿利布",
				  "自鳴琴","御玉杓子","陥穽");

YOMI[4] = new Array("おうむ","おおじか","おから","おもと",
				  "おおとり","おおばこ","オーロラ","おけら",
				  "おさむし","おしどり,おし","おぎ",
				  "おなもみ","おにやんま","オリーブ",
				  "オルゴール","おたまじゃくし","おとしあな");

// 「か」～「こ」

KANJI[5] = new Array("腕","楓","踵","牡蠣","歌留多","花椰菜",
				  "杜若","混合酒","蜉蝣","樫","卵糖","案山子",
				  "天牛","霞","加加阿","蒲鉾","甲虫",
				  "上下","蚕","蝸牛","酢漿草","金糸雀",
				  "蟷螂","蛙","柏","桂","蕪","鴨",
				  "鴎","落葉松");

YOMI[5] = new Array("かいな","かえで","かかと","かき","カルタ","カリフラワー",
				  "かきつばた","カクテル","かげろう","かし","カステラ","かかし",
				  "かみきりむし,かみきり","かすみ,か","カカオ","かまぼこ","かぶとむし",
				  "かみしも,かるめる","かいこ","かたつむり,かぎゅう","かたばみ","カナリア",
				  "かまきり","かえる,かわず","かしわ","かつら","かぶ,かぶら","かも",
				  "かもめ","からまつ");

KANJI[6] = new Array("木耳","雉子","煙管","啄木鳥","黄粉",
				  "茸","黍団子","肌理","胡瓜","螽斯",
				  "金木犀","沈菜");

YOMI[6] = new Array("きくらげ","きじ,きぎす,きぎし","キセル","きつつき","きなこ",
				  "きのこ","きびだんご","きめ,きり","きゅうり,きうり","きりぎりす",
				  "きんもくせい","キムチ");

KANJI[7] = new Array("水鶏","嚔","楠","山梔子","蜘蛛",
				  "轡虫","椚","海月","凝乳",
				  "鍬形","踝");

YOMI[7] = new Array("くいな","くしゃみ,くさめ","くす,くすのき","くちなし","くも",
				  "くつわむし","くぬぎ","くらげ","クリーム",
				  "くわがた","くるぶし");

KANJI[8] = new Array("芥子","華鬘草","欅","螻蛄","巻繊汁");

YOMI[8] = new Array("けし","けまんそう","けやき","けら","けんちんじる");

KANJI[9] = new Array("鸛","首","蝙蝠","蟋蟀","金亀子",
				  "苔","秋桜","鏝","洋杯","炬燵","珈琲",
				  "辛夷","混凝土","蒟蒻","胡椒",
				  "円規","木栓","燻牛肉","東風");

YOMI[9] = new Array("こうのとり","こうべ","こうもり","こおろぎ","こがねむし",
				  "こけ","コスモス","こて","コップ","こたつ","コーヒー",
				  "こぶし","コンクリート","こんにゃく","こしょう",
				  "コンパス","コルク","コンビーフ","こち");

// 「さ」～「そ」

KANJI[10] = new Array("賽子","栄螺","薩摩芋","甘蔗",
				  "蛹","条虫","百日紅","細波","秋刀魚",
				  "蠍","鷺","山茶花","珊瑚");

YOMI[10] = new Array("さいころ,さい","さざえ","さつまいも","さとうきび",
				  "さなぎ","さなだむし","さるすべり","さざなみ","さんま",
				  "さそり","さぎ","さざんか","さんご");

KANJI[11] = new Array("香蕈","鴫","樒","蜆","占地",
				  "柳葉魚","紫蘇","四十雀","羊歯",
				  "衣魚","石楠花","蝦蛄","襯衣",
				  "吃逆","軍鶏","精霊蝗",
				  "虱","雫","菖蒲");

YOMI[11] = new Array("しいたけ","しぎ","しきみ","しじみ","しめじ",
				  "ししゃも","しそ","しじゅうから","しだ",
				  "しみ","しゃくなげ","しゃこ","シャツ,しんい",
				  "しゃっくり,しゃくり","しゃも","しょうりょうばった",
				  "しらみ,しつ","しずく","しょうぶ");

KANJI[12] = new Array("西瓜","酸模","粗描","菫",
				  "清白","菘","双陸","鋤","胡蜂",
				  "簾","掏摸","李");

YOMI[12] = new Array("すいか","すかんぽ","スケッチ","すみれ",
				  "すずしろ","すずな","すごろく","すき","すずめばち",
				  "すだれ","すり","すもも");

KANJI[13] = new Array("鶺鴒","蝉時雨","芹","千振茶");

YOMI[13] = new Array("せきれい","せみしぐれ","せり","せんぶりちゃ");

KANJI[14] = new Array("曹達","雀斑","蚕豆","蕎麦");

YOMI[14] = new Array("ソーダ","そばかす","そらまめ","そば");

// 「た」～「と」

KANJI[15] = new Array("笋","橘","束子",
				  "蓼","鬣","掌","田螺","煙草",
				  "箪笥","蒲公英","黄昏");

YOMI[15] = new Array("たけのこ,たこうな","たちばな","たわし",
				  "たで","たてがみ","たなごころ","たにし","たばこ",
				  "たんす","たんぽぽ","たそがれ");

KANJI[16] = new Array("乾酪","鵆","哨吶",
				  "鬱金香","貯古齢糖","青梗菜");

YOMI[16] = new Array("チーズ","ちどり","チャルメラ",
				  "チューリップ","チョコレート","ちんげんさい");

KANJI[17] = new Array("栂","土筆","鶫","柘植","蔓",
				  "恙虫","躑躅","椿","蔦","爪楊枝",
				  "旋毛","旋風");

YOMI[17] = new Array("つが","つくし,つくしんぼ","つぐみ","つげ","つる",
				  "つつがむし","つつじ","つばき","つた","つまようじ",
				  "つむじ,つむじげ,つじ","つむじかぜ,つむじ,つじかぜ");

KANJI[18] = new Array("卓子","梃子","庭球","紅娘");

YOMI[18] = new Array("テーブル","てこ","テニス","てんとうむし");

KANJI[19] = new Array("蕃椒","蜥蜴","朱鷺","木賊",
				  "橡","椴松","馴鹿",
				  "蕃茄","薯蕷芋","隧道","蜻蛉",
				  "玉蜀黍");

YOMI[19] = new Array("とうがらし","とかげ","とき","とくさ",
				  "とち,とちのき","とどまつ","トナカイ",
				  "トマト","とろろいも","トンネル","とんぼ",
				  "とうもろこし");

// 「な」～「の」

KANJI[20] = new Array("長薯","凪","棗","汀","滑子",
				  "撫子","樹懶","蛞蝓",
				  "弱竹","楢","海鼠","茄子");

YOMI[20] = new Array("ながいも","なぎ","なつめ","なぎさ","なめこ",
				  "なでしこ","なまけもの","なめくじ",
				  "なよたけ","なら","なまこ","なす,なすび");

KANJI[21] = new Array("鳰","面皰","仮漆","洋銀","肉桂",
				  "膠","韮","接骨木","大蒜");

YOMI[21] = new Array("にお","にきび","ニス","ニッケル","にっけい,にっき",
				  "にかわ","にら","にわとこ,にわとこぎ","にんにく");

KANJI[22] = new Array("鵺","泥濘","微温湯","滑滑");

YOMI[22] = new Array("ぬえ","ぬかるみ","ぬるまゆ","ぬめぬめ");

KANJI[23] = new Array("葱","螺子","杜松","鼠",
				  "合歓","猫糞");

YOMI[23] = new Array("ねぎ","ネジ","ねず","ねずみ",
				  "ねむ,ねぶ,ねむのき,ねぶのき","ねこばば");

KANJI[24] = new Array("凌霄花","芒","蚤","熨斗","鋸",
				  "狼煙","海苔");

YOMI[24] = new Array("のうぜんかずら,のうぜんか,のうぜん","のぎ","のみ","のし","のこぎり",
				  "のろし","のり");

// 「は」～「ほ」

KANJI[25] = new Array("口風琴","繁縷","鋏","梯子","疾風","洟",
				  "蓮","鰰","花弁","隼","蠅",
				  "波布","蛤","手巾","送球","南風");

YOMI[25] = new Array("ハーモニカ","はこべ,はこべら","はさみ","はしご","はやて","はな,はなじる",
				  "はす,はちす","はたはた","はなびら","はやぶさ","はえ,はい",
				  "はぶ","はまぐり,はま","ハンカチ","ハンドボール","はえ");

KANJI[26] = new Array("抽斗","羆","鹿尾菜","蜩","雹",
				  "檜","雲雀","庇","蟇","髭",
				  "蛭","午睡","蹄","向日葵");

YOMI[26] = new Array("ひきだし","ひぐま,ひ","ひじき","ひぐらし","ひょう",
				  "ひのき,ひ","ひばり","ひさし","ひきがえる,ひき","ひげ",
				  "ひる","ひるね","ひづめ","ひまわり,ひゅうがあおい");

KANJI[27] = new Array("蕗","河豚","梟","紅鶴","頭垢","麩");

YOMI[27] = new Array("ふき","ふぐ","ふくろう","フラミンゴ","ふけ","ふ,ふすま");

KANJI[28] = new Array("糸瓜","臍","箆");

YOMI[28] = new Array("へちま","へそ","へら");

KANJI[29] = new Array("箒","鬼灯","黒子","矛",
				  "頬","時鳥","畔","熱",
				  "法螺貝","埃");

YOMI[29] = new Array("ほうき","ほおずき","ほくろ","ほこ",
				  "ほお,ほほ","ほととぎす","ほとり","ほとぼり",
				  "ほらがい","ほこり");

// 「ま」～「も」

KANJI[30] = new Array("蝸牛被","鉞","馬刀貝",
				  "睫毛","燐寸","松陰嚢",
				  "瞼","肉刺","毬藻","蝮",
				  "檬果","俎板");

YOMI[30] = new Array("まいまいかぶり","まさかり","まてがい",
				  "まつげ","マッチ","まつぼっくり,まつふぐり",
				  "まぶた","まめ","まりも","まむし",
				  "マンゴー","まないた");

KANJI[31] = new Array("鶚","微塵子","雨久花","蚯蚓",
				  "蓑虫","鳩尾","霙","茗荷",
				  "角鴟","耳朶","蹼");

YOMI[31] = new Array("みさご","みじんこ","みずあおい","みみず",
				  "みのむし","みぞおち,みずおち","みぞれ","みょうが",
				  "みみずく","みみたぶ","みずかき");

KANJI[32] = new Array("零余子","百足","毳","骸","椋鳥",
				  "貉","鼯鼠");

YOMI[32] = new Array("むかご","むかで","むくげ","むくろ","むくどり",
				  "むじな","むささび");

KANJI[33] = new Array("鍍金","雌蕊","和布蕪","目脂","麵媽","目眩");

YOMI[33] = new Array("メッキ","めしべ","めかぶ","めやに","メンマ","めまい");

KANJI[34] = new Array("艾","土竜","百舌","水雲","籾","椛",
				  "靄","最中");

YOMI[34] = new Array("もぐさ","もぐら,もぐらもち","もず","もずく","もみ","もみじ",
				  "もや","もなか");

// 「や」～「よ」

KANJI[35] = new Array("八重葎","山羊","馬陸","豺","谺","槍",
				  "椰子","寄居虫","豪猪","赤楝蛇","冬眠鼠");

YOMI[35] = new Array("やえむぐら","やぎ","やすで","やまいぬ","やまびこ","やり",
				  "やし","やどかり","やまあらし","やまかがし","やまね");

KANJI[36] = new Array("柚子","山桜桃","交譲葉","百合","湯湯婆");

YOMI[36] = new Array("ゆず","ゆすらうめ","ゆずりは","ゆり","ゆたんぽ");

KANJI[37] = new Array("葦切","夜鷹","涎","蓬");

YOMI[37] = new Array("よしきり","よたか","よだれ","よもぎ");

// 「ら」～「ろ」

KANJI[38] = new Array("豚脂","駱駝","辣韮","喇叭",
				  "騾馬","闘球","覇王花");

YOMI[38] = new Array("ラード","らくだ","らっきょう","ラッパ",
				  "らば","ラグビー","ラフレシア");

KANJI[39] = new Array("小酒","栗鼠","苹果","竜胆");

YOMI[39] = new Array("リキュール","リス","りんご","りんどう");

KANJI[40] = new Array("坩堝","瑠璃","輪盤賭","紅玉");

YOMI[40] = new Array("るつぼ","るり","ルーレット","ルビー");

KANJI[41] = new Array("小熊猫","連翹","蓮華","煉瓦");

YOMI[41] = new Array("レッサーパンダ","れんぎょう","れんげ","れんが");

KANJI[42] = new Array("轆轤","驢馬","臘梅","蝋燭");

YOMI[42] = new Array("ろくろ","ろば","ろうばい","ろうそく");

// 「わ」

KANJI[43] = new Array("稚海藻","山葵","草鞋","藁",
				  "鰐","蕨","吾亦紅","勿忘草","鷲");

YOMI[43] = new Array("わかめ","わさび","わらじ","わら",
				  "わに","わらび","われもこう","わすれなぐさ","わし");



// 「が」～「ご」

KANJI[44] = new Array("大蚊","硝子","蝦蟇","瓦礫","響尾蛇","雁擬き");

YOMI[44] = new Array("ががんぼ","ガラス","がま,がまがえる","がれき","がらがらへび","がんもどき");

KANJI[45] = new Array("限々","刻々","擬宝珠","餃子","蟯虫");

YOMI[45] = new Array("ぎりぎり","ぎざぎざ","ぎぼし,ぎぼうし,ぎぼうしゅ","ギョーザ,ギョウザ","ぎょうちゅう");

KANJI[46] = new Array("茱萸","葡萄柚","青豌豆");

YOMI[46] = new Array("ぐみ","グレープフルーツ","グリーンピース");

KANJI[47] = new Array("蚰蜒","紫雲英","源五郎");

YOMI[47] = new Array("げじげじ,げじ","げんげ","げんごろう");

KANJI[48] = new Array("胡麻","沙蚕","塵箱","護謨");

YOMI[48] = new Array("ごま","ごかい","ごみばこ","ゴム");

// 「ざ」～「ぞ」

KANJI[49] = new Array("石榴","笊","蝲蛄","搾菜");

YOMI[49] = new Array("ざくろ","ざる","ざりがに","ザーサイ");

KANJI[50] = new Array("自然薯","麝香鹿","蓴菜","如雨露","沈丁花","絡新婦");

YOMI[50] = new Array("じねんじょ","じゃこうじか","じゅんさい","じょうろ","じんちょうげ","じょろうぐも");

KANJI[51] = new Array("木菟");

YOMI[51] = new Array("ずく");

KANJI[52] = new Array("薇","発条");

YOMI[52] = new Array("ぜんまい","ぜんまい");

KANJI[53] = new Array("草履");

YOMI[53] = new Array("ぞうり");

// 「だ」～「ど」

KANJI[54] = new Array("橙","壁蝨","金剛石","達磨");

YOMI[54] = new Array("だいだい","だに","ダイヤモンド,ダイアモンド","だるま");

KANJI[55] = new Array();

YOMI[55] = new Array();

KANJI[56] = new Array();

YOMI[56] = new Array();

KANJI[57] = new Array("梯姑","蝸牛");

YOMI[57] = new Array("でいご","でんでんむし");

KANJI[58] = new Array("満天星","溝","避球");

YOMI[58] = new Array("どうだんつつじ,どうだん","どぶ","ドッジボール");

// 「ば」～「ぼ」

KANJI[59] = new Array("貘","馬穴","牛酪","薔薇","甘蕉","馬鈴薯");

YOMI[59] = new Array("ばく","バケツ","バター","ばら","バナナ","ばれいしょ");

KANJI[60] = new Array("天鵞絨","乾蒸餅","吃驚","麦酒");

YOMI[60] = new Array("ビロード","ビスケット","びっくり","ビール");

KANJI[61] = new Array("山毛欅","鞦韆","刷毛","錻力","葡萄");

YOMI[61] = new Array("ぶな","ブランコ","ブラシ","ブリキ","ぶどう");

KANJI[62] = new Array("遍羅","貝独楽");

YOMI[62] = new Array("べら","べいごま,べーごま");

KANJI[63] = new Array("孑孑","短艇","木瓜","雪洞","十柱戯");

YOMI[63] = new Array("ぼうふら","ボート","ぼけ","ぼんぼり","ボウリング,ボーリング");

// 「ぱ」～「ぽ」

KANJI[64] = new Array("大熊猫","鳳梨","万寿果","和蘭芹");

YOMI[64] = new Array("パンダ","パイナップル","パパイア,パパイヤ","パセリ");

KANJI[65] = new Array("洋琴","鉄嘴");

YOMI[65] = new Array("ピアノ","ピンセット");

KANJI[66] = new Array("普洱茶");

YOMI[66] = new Array("プーアルちゃ");

KANJI[67] = new Array("油漆","頁");

YOMI[67] = new Array("ペンキ,ペイント","ページ");

KANJI[68] = new Array("木履");

YOMI[68] = new Array("ぽっくり");
